{"name": "Grapevine Lake", "description": "Centrally located in the heart of the Dallas/Fort Worth Metroplex just minutes from DFW Airport, Grapevine Lake offers a variety of outdoor recreation opportunities. Nationally recognized trails, full service campgrounds, and beautiful day use areas surround the 7,276 acre lake which hosts over 2,000,000 visitors annually.", "locationType": "Recreation Area", "latitude": 32.965841, "longitude": -97.05545, "address": "110 Fairway Drive", "city": "Grapevine", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(817) 865-2600", "directions": "From Grapevine, 2 miles northeast on TX 121."}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M206760", "images": ["images/Grapevine_Lake_1.webp", "images/Grapevine_Lake_2.jpg", "images/Grapevine_Lake_3.jpg"], "verified": true, "isActive": true}
{"name": "Lewisville Lake", "description": "Just north of Dallas, popular Lewisville Lake is a 29,592 acre lake with unlimited outdoor recreation opportunities. Over 20 parks surround the lake and offer camping, hiking, picnicking, horseback riding, boating, and golf.", "locationType": "Recreation Area", "latitude": 33.06667, "longitude": -97.01667, "address": "1801 N Mill Street", "city": "Lewisville", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(469) 645-9100", "directions": "At Lewisville, east of I-35E."}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M209740", "images": ["images/Lewisville_Lake_1.webp", "images/Lewisville_Lake_2.jpg", "images/Lewisville_Lake_3.jpg"], "verified": true, "isActive": true}
{"name": "Lavon Lake", "description": "The Heard Natural Science Museum and Wildlife Sanctuary in nearby McKinney features natural history exhibits and nature trails.", "locationType": "Recreation Area", "latitude": 33.032862, "longitude": -96.484875, "address": "3375 Skyview Drive", "city": "Wylie", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(972) 442-3141", "directions": "From Wylie, 3 miles east on TX 78, 1 mile north on county road."}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M209580", "images": ["images/Lavon_Lake_1.webp", "images/Lavon_Lake_2.jpg", "images/Lavon_Lake_3.jpg"], "verified": true, "isActive": true}
{"name": "Joe Pool Lake", "description": "Joe Pool Lake is a 7,400-acre impoundment located in the southern portion of the Dallas-Fort Worth Metroplex. The lake is centrally located between Dallas and Fort Worth and has four developed parks: Britton Park, Cedar Hill State Park, Loyd Park and Lynn Creek Park. Local attractions within a 20-mile radius of the Joe Pool Lake include: Six Flags Over Texas, Hurricane Harbor Fun Park, The Ballpark at Arlington (Texas Rangers Baseball), Texas Stadium (Dallas Cowboys Football), Penn Farm at Cedar Hill State Park, and Lonestar Park at Grand Prairie (horse racing).", "locationType": "Recreation Area", "latitude": 32.61667, "longitude": -96.96667, "address": "P.O. Box 872", "city": "Cedar Hill", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(972) 299-2227"}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M209420", "images": ["images/Joe_Pool_Lake_1.webp", "images/Joe_Pool_Lake_2.jpg", "images/Joe_Pool_Lake_3.jpg"], "verified": true, "isActive": true}
{"name": "Lake O' The Pines", "description": "Lake O' the Pines includes about 18,700 acres of water and 9,000 acres of land located in the piney woods of Northeast Texas. The lake is located partially in Marion, Harrison, Upshur, Morris and Camp Counties. Recreation opportunities are numerous with camping, boating, fishing, hunting, watchable wildlife, and bird watching, including wintering bald eagles. Other local attractions include antique shopping, Mardi Gras Upriver, the Annual Historic Pilgrimage, and Christmas Candlelight Tour in Jefferson, TX. Local attractions also include Stagecoach days, a Fire Ant Festival and Christmas lights in Marshall, TX, along with Texas Wildflower Trail routes along some area roads.", "locationType": "Recreation Area", "latitude": 32.762437, "longitude": -94.494868, "address": "2669 Fm 726", "city": "Jefferson", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(903) 665-2336"}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M205850", "images": ["images/Lake_O_The_Pines_1.webp", "images/Lake_O_The_Pines_2.jpg", "images/Lake_O_The_Pines_3.jpg"], "verified": true, "isActive": true}
{"name": "Tishomingo National Wildlife Refuge", "description": "Tishomingo National Wildlife Refuge is one of more than 560 national wildlife refuges that form a network of United States lands and waters managed specifically for wildlife. Refuges provide habitat–food, water, cover, and space—for millions of migratory birds, including over 380 threatened or endangered species and thousands of species of native plants and animals. The refuge and century-old town get their name from the famous Chickasaw Chief, Tishomingo. The refuge was established in 1946 as an administrative overlay of Corps of Engineers land on a portion of the Washita Arm of Lake Texoma. The primary purpose of the refuge is to protect and manage 16,464 acres of habitat as refuge and breeding grounds for migratory birds and other wildlife. The refuge also provides wildlife-dependent recreational activities including wildlife observation and photography, fishing, hunting, environmental education, and interpretive programs for the public. Habitats within the Tishomingo National Wildlife Refuge include 2,050 acres of wetlands, 10,000 acres of uplands, and 250 acres of croplands. These lands and waters are actively managed to support more than 284 species of birds, 41 species of mammals, 66 species of amphibians and reptiles, 67 species of butterflies and 54 species of fish. The refuge has many superb places to experience birds. The headquarters boat ramp, the Prairie Pathways Trail, the Murray 23 boat dock and Jemison Overlook are good spots to see open water birds such as ducks, geese, and pelicans on the Cumberland Pool. You can find many species of sparrows as well as scissortail flycatchers, orioles, meadowlarks and many others from the Eagle Cove overlook “tower” just east of the Sandy Creek Bridge. The Craven Nature Trail is a great place to find woodpeckers, black and white warblers and blue-gray gnatcatchers in the forest section and grebes, ducks, herons and egrets from the boardwalk over Dick’s Pond. These are just a few of the wonderful sites available to view birds and other wildlife. Come early and often to experience the spectacular variety and abundance of birdlife on the refuge.", "locationType": "Recreation Area", "latitude": 34.206817, "longitude": -96.642871, "address": "12000 South Refuge Road", "city": "Tishomingo", "state": "OK", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-371-2402", "email": "null", "directions": "<p>Follow Highway 78 to the eastern edge of town. Turn south on Refuge Road, at the high school (watch for sign). Follow Refuge Road 2 miles to the refuge visitor center. </p><p>On US Highway 75/69 North, exit on Highway 78/48 (left). Continue on Hwy. 78/48 towards Kenefic, turn left on Highway 22 and at the Nida intersection turn slightly right towards Milburn, Hwy 78. Upon entering Tishomingo (watch for sign), turn left on Refuge Road and follow for 2 miles to the refuge visitor center.  </p>"}, "websiteUrl": "http://southwest.fws.gov/refuges/oklahoma/tishomingo", "images": ["images/Tishomingo_National_Wildlife_Refuge_1.jpg", "images/Tishomingo_National_Wildlife_Refuge_2.webp", "images/Tishomingo_National_Wildlife_Refuge_3.jpg"], "verified": true, "isActive": true}
{"name": "Arbuckle Lake", "description": "Lake of the Arbuckles is forned by Arbuckle Dam which is a feature of the Arbuckle Project . The lake is located at the confluence of the Buckhorn, Guy Sandy, and Rock Creeks. The area presents unusual opportunities, combining recreational use with scenic, scientific, and historic values. The Arbuckle Mountains are the highest part of a large area of Precambrian granites and overlying sedimentary strata that were uplifted and deformed some 300 million years ago. Subsequent erosion has exposed features which make the area an outstanding laboratory for students of geology.The Lake is one of the best fishing lakes in Oklahoma for catfish, crappie, largemouth bass, white bass, and bluegill. There are 36 miles of shoreline and 2,300 acres of open water. Fishing is permitted year round. The wildlife area is a habitat for turkey, deer, and small game birds. There are several boat ramps and camping facilities. The Arbuckle Project regulates flows of Rock Creek, a tributary of the Washita River in south-central Oklahoma.", "locationType": "Recreation Area", "latitude": 34.43568, "longitude": -97.00677, "address": "Chickasaw National Recreation Area P.O. Box 201", "city": "Sulphur", "state": "OK", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-622-3165", "directions": "From Sulphur, OK, drive 10 miles south on State Highway 177."}, "websiteUrl": "http://www.nps.gov/chic", "images": ["images/Arbuckle_Lake_1.jpg", "images/Arbuckle_Lake_2.jpg", "images/Arbuckle_Lake_3.jpg"], "verified": true, "isActive": true}
{"name": "Chickasaw National Recreation Area", "description": "Springs, streams, lakes - whatever its form, water is the attraction at Chickasaw National Recreation Area.", "locationType": "Recreation Area", "latitude": 34.460505, "longitude": -97.007157, "address": "901 W. 1st Street", "city": "Sulphur", "state": "OK", "country": "US", "amenities": ["Biking", "Boating", "Camping", "Fishing", "Picnicking", "Hiking", "Horseback Riding", "Hunting", "Paddling", "Swimming", "Water Skiing", "Wildlife Watching", "Chickasaw National Recreation Area"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(580) 622-7234", "email": "chic_interpretation@nps.gov", "directions": "From US I-35 drive through the towns of Davis and towards the town of Sulphur. There are a variety of destinations in the park to choose from."}, "websiteUrl": "https://www.nps.gov/chic/", "images": ["images/Chickasaw_National_Recreation_Area_1.webp", "images/Chickasaw_National_Recreation_Area_2.webp", "images/Chickasaw_National_Recreation_Area_3.webp", "images/Chickasaw_National_Recreation_Area_4.webp", "images/Chickasaw_National_Recreation_Area_5.webp", "images/Chickasaw_National_Recreation_Area_6.webp"], "verified": true, "isActive": true}
{"name": "Dequeen Lake", "description": "The U.S. Army Corps of Engineers welcomes you to DeQueen Lake and wishes you an enjoyable stay at the project. The project offers the visitor extensive opportunities for a memorable outdoor recreation experience. Food, bait, tackle, etc. are available near the lake. Project personnel are available and will be happy to assist in assuring you a pleasant stay.", "locationType": "Recreation Area", "latitude": 34.09833, "longitude": -94.38167, "address": "706  Dequeen Lake Road", "city": "Dequeen", "state": "AR", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(870) 584-4161", "directions": "From DeQueen, 8 miles north on US 71. 5 miles west to the lake."}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M404620", "images": ["images/Dequeen_Lake_1.webp", "images/Dequeen_Lake_2.webp", "images/Dequeen_Lake_3.webp"], "verified": true, "isActive": true}
{"name": "Little River National Wildlife Refuge", "description": "Little River National Wildlife Refuge’s primary purpose is to preserve the bottomland hardwood forests for migratory birds and waterfowl on the Central Flyway. The 14,216-acre refuge was established in 1987 as the nation’s 438th refuge, and protects one of the largest remaining areas of bottomland hardwood forests found in Oklahoma. The refuge features low, wet habitat with old oxbow lakes and sloughs that wind their way throughout the bottomland habitat. Most of the refuge is forested with bottomland species such as willow oak, overcup oak, Shumard oak, sweetgum, cypress, white oak, and holly. Some areas on higher ground support species such as loblolly pine, hickory, and walnut. As you gaze at the wildlands protected by Little River National Wildlife Refuge you might be able to picture a prehistoric people who hunted and gathered here between 6,000 and 10,000 B.C., a time known as the Archaic period. Archeologists know that the culture began to change by about 100 A.D. Pottery shards from the area show us that these people may have begun farming by 800 A.D. This culture emerged as the Caddoan speaking people, known for mound building and ceremonial burial practices. Mounds exist on the refuge but were disturbed by forestry practices prior to the establishment of the refuge. The Caddoan people left this area by the time Europeans explored Little River in the early 1700s. A century later, in 1830, the Choctaw Indians arrived at the end of the “Trail of Tears.” Thousands of native Americans were forcibly removed from their homelands in Alabama and Mississippi and relocated to southeast Oklahoma. McCurtain County was named for a tribal member who became the Chief of the Choctaw Nation. His three sons each served as chief. The Choctaw and other settlers started clearing the forests to grow corn and cotton. By the mid-1900s, major timber companies like Weyerhaeuser, arrived to log forests and eventually start loblolly pine plantations. The bottomland forests preserved at Little River stand as silent sentinels to both land and cultural changes. Today, an extensive forest management plan is in place to maintain a healthy, productive bottomland hardwood forest to meet the habitat needs of a diversity of fish and wildlife species.", "locationType": "Recreation Area", "latitude": 33.9584, "longitude": -94.7538, "address": "P.O. Box 340", "city": "Broken Bow", "state": "OK", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-584-6211", "email": "david_weaver@fws.gov", "directions": "<p>The headquarters for the Little River National Wildlife Refuge is located at 635 South Park Drive on HWY 259 in the City of Broken Bow, Oklahoma. The coordinates for the headquarters office are <a href=\"http://maps.google.com/maps?hl=en&cp=22&gs_id=3&xhr=t&bav=on.2,or.r_gc.r_pw.r_qf.,cf.osb&biw=1600&bih=815&q=34.020701,-94.737666&um=1&ie=UTF-8&hq=&hnear=0x86356ad9d04efe59:0xad1270e32ee1256c,%2B34%C2%B0+1%27+15.55%22,+-94%C2%B0+44%27+15.90%22&gl=us&ei=biSpT9TZHcLfiALB0cDYAg&sa=X&oi=geocode_result&ct=title&resnum=1&sqi=2&ved=0CBwQ8gEwAA\" rel=\"nofollow\">34.020701,-94.737666</a>.  </p>"}, "websiteUrl": "http://www.fws.gov/refuge/little_river/", "images": ["images/Little_River_National_Wildlife_Refuge_1.jpg", "images/Little_River_National_Wildlife_Refuge_2.webp", "images/Little_River_National_Wildlife_Refuge_3.jpg"], "verified": true, "isActive": true}
{"name": "Gillham Lake", "description": "The Corps of Engineers invites you to visit Gillham Lake, \"The Bright Spot on the Cossatot\" and wishes you an enjoyable stay at the project and a memorable outdoor recreation experience. Overnight accommodations, food, bait, tackle, and other needs are available from businesses near the lake. Project personnel are available and will be happy to assist in assuring you a pleasant stay.", "locationType": "Recreation Area", "latitude": 34.21, "longitude": -94.23, "address": "706 DeQueen Lake RD", "city": "Ashdown", "state": "AR", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(870) 898-3343", "directions": "From DeQueen, 15 miles north on US 71, 5 miles east to lake."}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M406550", "images": ["images/Gillham_Lake_1.webp", "images/Gillham_Lake_2.webp", "images/Gillham_Lake_3.webp"], "verified": true, "isActive": true}
{"name": "Broken Bow Lake", "description": "The McCurtain County Wilderness Area at the lake's north end retains its primitive, natural beauty.", "locationType": "Recreation Area", "latitude": 34.145816, "longitude": -94.685218, "address": "175 White Dove Lane", "city": "Valliant", "state": "OK", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(580) 933-4239", "directions": "From Broken Bow, 7 miles north on US 259, 2 miles east on OK 259-A."}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M502040", "images": ["images/Broken_Bow_Lake_1.webp", "images/Broken_Bow_Lake_2.jpg", "images/Broken_Bow_Lake_3.jpg"], "verified": true, "isActive": true}
{"name": "HANKS CREEK", "description": "Overview Hanks Creek Park has something for everyone, with plenty of water sports on Sam Rayburn Reservoir and volleyball, mountain biking, wild life viewing and birding for those who want to stay on shore. The Red-cockaded woodpecker, an endangered species, is found throughout the forest surrounding the reservoir. The bird makes its home by pecking cavities in large, living pine trees. Recreation Fishing is excellent for largemouth bass, crappie, catfish and sunfish, with frequent fishing tournaments. The lake is also popular for jet skiing, water skiing and swimming. Facilities The park features 47 campsites with electric hookups. Additional amenities include group camping, a playground, boat ramp and hot showers. Natural Features Sam Rayburn Reservoir, also called Lake Sam Rayburn, boasts over 114,000 surface acres, making it the largest man-made lake completely in Texas. It's surrounded by the Angelina National Forest, and is within short proximity to the Sabine and Davy Crockett National Forests. Nearby Attractions The 20,700-acre Bannister Wildlife Management Area is on the northern peninsula of the lake. Hikers and bikers can come here to explore the designated Eastern Wild Turkey restoration site.", "locationType": "Campground", "latitude": 31.2719444, "longitude": -94.4030556, "address": "7696 RR 255 WEST", "city": "JASPER", "state": "TX", "country": "US", "amenities": ["HANK", "SAM RAYBURN RESERVOIR", "SAM RAYBURN LAKE", "HANKS CREEK PARK", "SAM RAYBURN RESERVOIR"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "409-384-5716", "directions": "From Zavalla, TX, take State Hwy 147 northeast for 1/4 mile, then turn\nnorth on FM 2109, go 8 miles to FM 2801. Turn right (east) on FM 2801 and go 2\nmiles to the park entrance. Follow signs into the campground."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/HANKS_CREEK_1.webp", "images/HANKS_CREEK_2.webp", "images/HANKS_CREEK_3.jpg"], "verified": true, "isActive": true}
{"name": "Jackson Hill", "description": "This recreation area is part of Sam Rayburn Reservoir", "locationType": "Facility", "latitude": 31.2700588, "longitude": -94.32159027, "address": null, "city": "Jasper", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M216040", "images": ["images/Jackson_Hill_1.jpg", "images/Jackson_Hill_2.jpg", "images/Jackson_Hill_3.jpg"], "verified": true, "isActive": true}
{"name": "Townsend", "description": "Overview This location is available on a first-come, first-served basis only. Visitors are required to physically arrive at the campground to purchase and claim a site. Once on-site, you may be able to pay for your campsite(s) by scanning a QR code using the Recreation.gov mobile app, and the Scan and Pay feature. If this option is available, you will need to first download the free Recreation.gov mobile app Recreation.gov prior to your arrival as some remote areas have limited or no cellular service. Recreation Boat ramp,Tent camping,Picnic tables,Parking Natural Features ocated in the heart of east Texas, the 153,179-acre Angelina National Forest is located in Angelina, Nacogdoches, San Augustine and Jasper counties. The forest lies in the Neches River Basin and on the north and south shores of Sam Rayburn Reservoir, a 114,500-acre lake on the Angelina River formed by the construction of Sam Rayburn Dam in the early 1960's. Nearby Attractions Lake Sam Rayburn", "locationType": "Campground", "latitude": 31.3523, "longitude": -94.3138, "address": null, "city": null, "state": null, "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": null, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "N/A", "email": "N/A"}, "websiteUrl": null, "images": ["images/Townsend_1.webp", "images/Townsend_2.jpg", "images/Townsend_3.jpg"], "verified": true, "isActive": true}
{"name": "Cassells Boykin", "description": "This recreation area is part of Sam Rayburn Reservoir", "locationType": "Facility", "latitude": 31.294343, "longitude": -94.313651, "address": null, "city": "Jasper", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M216040", "images": ["images/Cassells_Boykin_1.jpg", "images/Cassells_Boykin_2.jpg", "images/Cassells_Boykin_3.jpg"], "verified": true, "isActive": true}
{"name": "Shirley Creek", "description": "This recreation area is part of Sam Rayburn Reservoir", "locationType": "Facility", "latitude": 31.30896019, "longitude": -94.37346419, "address": null, "city": "Jasper", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M216040", "images": ["images/Shirley_Creek_1.jpg", "images/Shirley_Creek_2.jpg", "images/Shirley_Creek_3.jpg"], "verified": true, "isActive": true}
{"name": "EAST FORK (TX)", "description": "Overview East Fork Campground, on the southern shores of Lavon Lake, is a popular escape for city dwellers in the Dallas, Texas area or for any visitors passing through the Northern Texas region. The campground boasts everything including RV campsites, tent campsites, equestrian campsites, a group shelter and a swimming beach to keep visitors entertained during their stay. Recreation Boating and fishing are consistently popular activities for lake-goers. Horseback riding and hiking is great along the Trinity Trail, with a trailhead beginning adjacent to the East Fork campground. Facilities The campground offers 50 sites with water and electric hookups, plus 12 tent-only sites. There are not sewer hook-ups at the campsite, but there is a dump station located near the park entrance. It's the only campground at Lavon Lake with 50-amp electricity. Extra conveniences include hot showers and two boat ramps. The group campground is available year-round and fits 175 guests. Horses are allowed at the Equestrian Loop, and each equestrian site has a portable horse stall. Natural Features Lavon Lake, in northern Texas, flows from the East Fork tributary of the Trinity River. Its surface area spans 21,400 acres and the maximum lake depth of around 59 ft.. Nearby Attractions The Heard Natural Science Museum and Wildlife Sanctuary features natural history exhibits and nature trails.", "locationType": "Campground", "latitude": 33.0388889, "longitude": -96.5102778, "address": "1901 SKYVIEW DRIVE", "city": "WYLIE", "state": "TX", "country": "US", "amenities": ["EAF2", "LAVON LAKE", "LAKE LAVON", "LAVON LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "972-442-3141", "email": "paula.j.bennett@swf02.usace.army.mil", "directions": "<p>From Lavon, TX, travel South on Highway 78, take a right onto County Road 384. Travel until you come to a stop sign, then turn left onto Skyview Dr. and travel West for approximately 1.6 miles. East Fork will be on your right.  </p>"}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/EAST_FORK_TX_1.webp", "images/EAST_FORK_TX_2.webp", "images/EAST_FORK_TX_3.webp"], "verified": true, "isActive": true}
{"name": "MURRELL PARK", "description": "Overview Murrell Park offers day use facilities, boat ramp access and primitive camping on scenic Grapevine Lake, in the middle of the Dallas-Fort Worth Metroplex in Texas. The lake has become a premier recreation destination for the Southwest and offers some of the best camping, fishing and boating in Texas. This facility is open year-round, but particularly in hot summer months, the cool water provides a refreshing break from the Texas heat. Recreation Murrell Park is popular for picnicking, hiking, mountain biking, boating and fishing. The park is home to the well known Northshore Trail, which welcomes hikers and mountain bikers. Horses and moterized bikes including E-Bikes are not permitted on the Northshore Trail. Horses not permited in Murrell Park; however, there are horse trails available on the south side and west end of the lake. Hunting is not allowed in the park, but is available in some of the surrounding public lands. Anglers can fish along the shoreline or from the water; popular species include black and white crappie, catfish and bass. Facilities This facility offers 11 tent-only campsites along the lakeshore with views of the water. These sites do not have electrical or water hook ups. All campsites have campfire rings and grills, picnic tables and some have picnic shelters. Two pit toilets are provided; shower and flush toilet facilities are not available. a comunity water spigot is available from spring through fall and are shut off some of the winter months. It is recommended that campers provide their own water. The park contains one low water boat ramp as well as a high water boat ramp. Natural Features Grapevine is an 7,280 acre recreational lake with 60 miles of rolling shoreline. The area offers a wide variety of wildlife to observe, including white-tailed deer, turkey, squirrel, armadillo, rabbit and numerous birds species. Nearby Attractions The nearby city of Grapevine offers many historical attractions as one of the oldest settlements in the county, dating back to 1844, a year before Texas became a part of the United States. Charges & Cancellations No refunds on weather related cancelations.", "locationType": "Campground", "latitude": 32.9975, "longitude": -97.0891667, "address": "880 SIMMONS RD", "city": "FLOWER MOUND ", "state": "TX", "country": "US", "amenities": ["MURRELL PARK", "GRAPEVINE LAKE", "GRAPEVINE", "FLOWER MOUND"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "817-865-2600", "email": "ami.e.watkins@usace.army.mil", "directions": "Grapevine Lake is located in the Dallas-Fort Worth Metroplex, south of Denton, Texas. The north side of the lake is almost entirely within the town boundaries of Flower Mound, Texas in Denton county.  \nThe south side of the lake is located in Grapevine, Trophy Club and Southlake, Texas in Tarrant County.   \n The parks physical address is 880 Simmions Road, Flower Mound, Texas"}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/MURRELL_PARK_1.webp", "images/MURRELL_PARK_2.webp", "images/MURRELL_PARK_3.webp", "images/MURRELL_PARK_4.webp"], "verified": true, "isActive": true}
{"name": "HACKBERRY PAVILION", "description": "Overview Hackberry Pavilion is an excellent place for visitors to spend the day at Lavon Lake, enjoying the beach, picnicking and boating. Recreation Lavon Lake's most common fish include the largemouth bass, white bass, blue catfish and crappie. Horseback riding and hiking is sublime on the nearby Trinity Trail. Facilities The picnic pavilion holds a whopping 500 guests and the sandy swimming beach is a big hit during warm months. Natural Features The pavilion is located in Avalon Park, on the south shores of Lavon Lake. The lake is sourced by the East Fork tributary of the Trinity River and spans a surface area of 21,400 acres in northern Texas. The name \"hackberry,\" refers to the deciduous tree which commonly thrives in warm temperate regions, of Texas, including the area around Lavon Lake. Nearby Attractions The town of Wylie is home to a wildlife rescue and education center, where visitors can see lions, leopards, cougars, bobcats and more.", "locationType": "Campground", "latitude": 33.0416667, "longitude": -96.5, "address": "3455 SKYVIEW DR", "city": "WYLIE", "state": "TX", "country": "US", "amenities": ["HACK", "Large Avalon", "LAVON LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "972-442-3141", "directions": "Hackberry Pavilion is located on the east end of Avalon Park. \n\nFrom Wylie, TX, Go North on State Highway 78, take a left on Eubanks, and a right on Skyview Drive. Avalon Park is on the left side of the road.\n\nFrom Lavon, go South on State Highway 78 approximately 2 miles, after crossing over the Trinity River, turn right at \nLavon Reservoir sign (CR 384). At the intersection of CR 384 and Skyview Drive, take a left and continue 1/2 mile;\nAvalon Park will be on the right.  "}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/HACKBERRY_PAVILION_1.jpg", "images/HACKBERRY_PAVILION_2.jpg", "images/HACKBERRY_PAVILION_3.jpg"], "verified": true, "isActive": true}
{"name": "CLEAR LAKE (TX)", "description": "Overview Clear Lake Campground has a prime location on the shores of Lavon Lake. It is the only shaded campground at the lake, and provides a quiet space for anglers, bird watchers and photographers. The park is just northeast of Dallas, Texas, and just east of the Southfork Ranch, where the hit TV series, \"Dallas,\" was filmed. Recreation Visitors of all ages enjoy outdoor opportunities like fishing, boating, hiking, and picnicking. Anglers often find channel catfish, crappie, striped bass and hybrid bass. Facilities The Clear Lake Campground offers 23 sites with water, sewer and electric hookups. Hot showers, a boat ramp and fishing dock are also available. The group campground fits 200 people and has toilets reserved solely for group campers. The picnic shelter at the group site comes with electric and water hookups, four cookers, and a campfire ring. There's also a large playing field for sports. Natural Features Grassy flat fields and leafy shade trees cover the campground. The Lavon Lake spans 21,400 acres and stems from the East Fork of the Trinity River. Nearby Attractions The town of Wylie is home to a wildlife rescue and education center. Visitors can see lions, leopards, cougars, bobcats and more.", "locationType": "Campground", "latitude": 33.0552778, "longitude": -96.4819444, "address": "8199 County Road 436 ", "city": "PRINCETON", "state": "TX", "country": "US", "amenities": ["CLEL", "LAVON LAKE", "LAKE LAVON", "LAVON LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "972-442-3014", "directions": "While traveling on US Highway 380 in Princeton, TX, take South 2nd Street (County Road 982) South. County Road 982\nchanges into County Road 735. At the 4 way stop sign (just past the Lavon Lake Camp and Conference Center), take a right on County Road 436.  Watch for Clear Lake signs. Take County Road 436 and follow into Clear Lake Park."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/CLEAR_LAKE_TX_1.webp", "images/CLEAR_LAKE_TX_2.webp", "images/CLEAR_LAKE_TX_3.jpg"], "verified": true, "isActive": true}
{"name": "LAVONIA", "description": "Overview Lavonia Campground is a scenic Texas getaway just beyond the Dallas metropolitan area. Visitors can camp, swim, fish, boat or use the day use area. Recreation Visitors of all ages can enjoy activities like camping, fishing, boating and picnicking. Anglers seek species like channel catfish, crappie and striped bass. Facilities The campground offers 38 RV sites with water, 30 amp electric and sewer hook-ups. The campground has 15 tent sites. Additional perks include hot showers and a boat launch. Natural Features The Lavon Lake, in northern Texas, spans 21,400 acres and stems from the East Fork of the Trinity River. Nearby Attractions The paved Sister Groves Trail at Sister Grove Creek is a hot spot for biking and hiking. Contact Info For facility specific information, please call (877) 444-6777.", "locationType": "Campground", "latitude": 33.0377778, "longitude": -96.4455556, "address": "1301 COUNTY ROAD 486", "city": "LAVON", "state": "TX", "country": "US", "amenities": ["LAVO", "LAVON LAKE", "LAKE LAVON", "LAVON LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "972-442-3141", "directions": "From Wylie, Texas take State Highway 78 North to Lake Road (County Road 486) located in the city of Lavon.  Take a left on Lake Road.  Follow signs into the campground by taking a left over the railroad tracks bridge."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/LAVONIA_1.webp", "images/LAVONIA_2.jpg", "images/LAVONIA_3.jpg"], "verified": true, "isActive": true}
{"name": "Loyd", "description": "This recreation area is part of Joe Pool Lake", "locationType": "Facility", "latitude": 32.60502978, "longitude": -97.06670567, "address": null, "city": "Cedar Hill", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M209420", "images": ["images/Loyd_1.jpg", "images/Loyd_2.jpg", "images/Loyd_3.jpg"], "verified": true, "isActive": true}
{"name": "Cedar Hill State Park", "description": "This recreation area is part of Joe Pool Lake", "locationType": "Facility", "latitude": 32.61638082, "longitude": -96.99239775, "address": null, "city": "Cedar Hill", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M209420", "images": ["images/Cedar_Hill_State_Park_1.jpg", "images/Cedar_Hill_State_Park_2.jpg", "images/Cedar_Hill_State_Park_3.jpg"], "verified": true, "isActive": true}
{"name": "Murrell", "description": "This recreation area is part of Grapevine Lake", "locationType": "Facility", "latitude": 32.99761124, "longitude": -97.08924608, "address": null, "city": "Grapevine", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M206760", "images": ["images/Murrell_1.jpg", "images/Murrell_2.jpg", "images/Murrell_3.jpg"], "verified": true, "isActive": true}
{"name": "Twin Coves", "description": "This recreation area is part of Grapevine Lake", "locationType": "Facility", "latitude": 33.00574524, "longitude": -97.10469561, "address": null, "city": "Grapevine", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M206760", "images": ["images/Twin_Coves_1.jpg", "images/Twin_Coves_2.jpg", "images/Twin_Coves_3.jpg"], "verified": true, "isActive": true}
{"name": "The Vineyards", "description": "This recreation area is part of Grapevine Lake", "locationType": "Facility", "latitude": 32.95678596, "longitude": -97.07577066, "address": null, "city": "Grapevine", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M206760", "images": ["images/The_Vineyards_1.jpg", "images/The_Vineyards_2.jpg", "images/The_Vineyards_3.jpg"], "verified": true, "isActive": true}
{"name": "Collin Park", "description": "This recreation area is part of Lavon Lake", "locationType": "Facility", "latitude": 33.0453339, "longitude": -96.53154875, "address": null, "city": "Wylie", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M209580", "images": ["images/Collin_Park_1.jpg", "images/Collin_Park_2.jpg", "images/Collin_Park_3.jpg"], "verified": true, "isActive": true}
{"name": "Stewarts Creek", "description": "This recreation area is part of Lewisville Lake", "locationType": "Facility", "latitude": 33.084452, "longitude": -96.918995, "address": null, "city": "Lewisville", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M209740", "images": ["images/Stewarts_Creek_1.jpg", "images/Stewarts_Creek_2.jpg", "images/Stewarts_Creek_3.jpg"], "verified": true, "isActive": true}
{"name": "Lewisville Lake Park", "description": "This recreation area is part of Lewisville Lake", "locationType": "Facility", "latitude": 33.07233874, "longitude": -97.00064648, "address": null, "city": "Lewisville", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M209740", "images": ["images/Lewisville_Lake_Park_1.jpg", "images/Lewisville_Lake_Park_2.jpg", "images/Lewisville_Lake_Park_3.jpg"], "verified": true, "isActive": true}
{"name": "BRUSHY CREEK DAY USE", "description": "Overview Brushy Creek Day Use Area is situated along the banks of Lake O' the Pines in the Ark-La-Tex portion of the Pineywoods of east Texas near the states of Arkansas, Oklahoma, and Louisiana. Address to get here: . Jefferson, TX 75657 Recreation Boating, fishing, water sports, and wildlife viewing are all popular pastimes at the campground. Hunting opportunities for white-tailed deer, waterfowl, and small game are available on nearby public lands. Lake O' the Pines fishing includes largemouth, spotted, and white bass along with crappie, catfish, and sunfish. In addition to boat fishing there are areas for bank fishing along the shore and below the dam along Big Cypress Bayou. Birdwatchers are also encouraged to bring their binoculars as numerous resident and migratory bird species inhabit the area. Bald eagle sightings are a common occurrence in fall and winter and they are occasionally sighted in spring and summer. Boating, fishing, hunting and wildlife viewing are all popular pastimes at Brushy Creek. Facilities Brushy Creek Day Use area offers one large group picnic shelter, along with 30 smaller, non-reservable picnic sites located in shady areas along the shore. Each site has tables and grills. A boat ramp, courtesy dock, swimming beach and basketball court are also provided, making the area perfect for large parties or family functions. Natural Features Lake O' the Pines includes about 18,700 acres of water and 9,000 acres of land. The lake was created by the construction of the Ferrell's Bridge Dam on the Big Cypress Bayou. The reservoir was originally created as part of the overall plan for flood control in the Red River Basin below Denison Dam in Oklahoma, and has now become a recreational oasis for outdoor enthusiasts. Nearby Attractions Other historic and tourist attractions are nearby in the towns of Jefferson and Marshall, and Texas Wildflower Trail routes are located along the roads surrounding the lake.", "locationType": "Campground", "latitude": 32.7383333, "longitude": -94.5747222, "address": "2669 FM 726", "city": "Jefferson", "state": "TX", "country": "US", "amenities": ["Shady Grove"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "903-777-3383", "directions": "From Jefferson, Texas, travel 3.8 miles northwest on Highway 49. Turn left onto FM 729 and continue for 3.5 miles, then turn left again onto FM 726. Travel 5.0 miles turn right at the stop sign and follow signs to the park entrance. "}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/BRUSHY_CREEK_DAY_USE_1.webp", "images/BRUSHY_CREEK_DAY_USE_2.webp", "images/BRUSHY_CREEK_DAY_USE_3.webp", "images/BRUSHY_CREEK_DAY_USE_4.webp", "images/BRUSHY_CREEK_DAY_USE_5.webp", "images/BRUSHY_CREEK_DAY_USE_6.webp"], "verified": true, "isActive": true}
{"name": "LAKESIDE DAY USE", "description": "Overview Lakeside Day Use Area is situated along the banks of the Lake O' the Pines in the Ark-La-Tex portion of the Pineywoods of east Texas near the states of Arkansas, Oklahoma, and Louisiana. Address to get here: 5177 FM 726, Jefferson, TX 75657 Recreation Boating, fishing, water sports, and wildlife viewing are all popular pastimes at the campground. Hunting opportunities for white-tailed deer, waterfowl, and small game are available on nearby public lands. Lake O' the Pines fishing includes largemouth, spotted, and white bass along with crappie, catfish, and sunfish. In addition to boat fishing there are areas for bank fishing along the shore and below the dam along Big Cypress Bayou. Birdwatchers are also encouraged to bring their binoculars as numerous resident and migratory bird species inhabit the area. Bald eagle sightings are a common occurrence in fall and winter and they are occasionally sighted in spring and summer. Facilities Lakeside Park offers one large group picnic shelter, complete with electric hookups, that can accommodate up to 100 guests. A boat ramp, dock and swimming beaches, and a volleyball court are also provided, making the area perfect for large parties or family functions. Natural Features Lakeside Day use is located near the Ferrell's Bridge Dam. Lake O' the Pines includes about 18,700 acres of water and 9,000 acres of land. The lake was created by the construction of the Ferrell's Bridge Dam on the Big Cypress Bayou. The reservoir was originally created as part of the overall plan for flood control in the Red River Basin below Denison Dam in Oklahoma, and has now become a recreational oasis for outdoor enthusiasts. Nearby Attractions Other historic and tourist attractions are nearby in the towns of Jefferson and Marshall, and Texas Wildflower Trail routes are located along the roads surrounding the lake.", "locationType": "Campground", "latitude": 32.7491667, "longitude": -94.5122222, "address": "2669 FM 726", "city": "Jefferson ", "state": "TX", "country": "US", "amenities": ["Sandy Beach"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "903-665-2336", "directions": "From Jefferson, Texas, travel 3.8 miles northwest on Highway 49. Turn left onto FM 729 and continue for 3.5 miles, then turn left again onto FM 726. Travel 3.5 miles the park entrance will be on the right."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/LAKESIDE_DAY_USE_1.webp", "images/LAKESIDE_DAY_USE_2.webp", "images/LAKESIDE_DAY_USE_3.webp", "images/LAKESIDE_DAY_USE_4.webp", "images/LAKESIDE_DAY_USE_5.webp", "images/LAKESIDE_DAY_USE_6.webp", "images/LAKESIDE_DAY_USE_7.webp", "images/LAKESIDE_DAY_USE_8.webp", "images/LAKESIDE_DAY_USE_9.webp", "images/LAKESIDE_DAY_USE_10.webp", "images/LAKESIDE_DAY_USE_11.webp", "images/LAKESIDE_DAY_USE_12.webp", "images/LAKESIDE_DAY_USE_13.webp", "images/LAKESIDE_DAY_USE_14.webp"], "verified": true, "isActive": true}
{"name": "ALLEY CREEK CAMP", "description": "Overview Alley Creek Campground is situated along the banks of Lake O' the Pines in the Ark-La-Tex portion of the Pineywoods of east Texas near the states of Arkansas, Oklahoma, and Louisiana. Gate House Hours: 10am-6pm Monday through Saturday, 12pm-6pm Sunday Recreation Boating, fishing, water sports, and wildlife viewing are all popular pastimes at the campground. Hunting opportunities for white-tailed deer, waterfowl, and small game are available on nearby public lands. Lake O' the Pines fishing includes largemouth, spotted, and white bass along with crappie, catfish, and sunfish. In addition to boat fishing there are areas for bank fishing along the shore and below the dam along Big Cypress Bayou. Birdwatchers are also encouraged to bring their binoculars as numerous resident and migratory bird species inhabit the area. Bald eagle sightings are a common occurrence in fall and winter and they are occasionally sighted in spring and summer. Facilities Alley Creek features 49 RV campsites with water and electric hookups. There are also 30 tent campsites that have a picnic table, fire ring, and lantern pole. A group camping area is located in the park which has a group shelter with restrooms and showers and 12 RV sites with water and electric hookups. Restrooms with showers are located in each section of the park. Trash receptacles are located throughout the park. A boat ramp, playground, swimming beach, and sewer dump station are also provided. Natural Features Lake O' the Pines includes about 18,700 acres of water and 9,000 acres of land, encompassing an area so large it spans five counties. The lake was created by the construction of the Ferrell's Bridge Dam on the Big Cypress Bayou. The reservoir was originally created as part of an overall plan for flood control in the Red River Basin below Denison Dam in Oklahoma, and has now become a recreational oasis for outdoor enthusiasts. Nearby Attractions The nearby towns of Jefferson and Marshall offer historic and tourist attractions, and Texas Wildflower Trail routes are located along the roads surrounding the lake.", "locationType": "Campground", "latitude": 32.7994444, "longitude": -94.5919444, "address": "2669 FM 726", "city": "JEFFERSON", "state": "TX", "country": "US", "amenities": ["ACRC", "LAKE  OF THE PINES", "LAKE O THE PINES", "FERRELLS BRIDGE DAM"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "903-755-2637", "directions": "From Jefferson, TX, travel 3.8 miles northwest on Highway 49. Turn left onto FM 729 and continue for 12 miles to the park entrance on the left."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/ALLEY_CREEK_CAMP_1.webp", "images/ALLEY_CREEK_CAMP_2.webp", "images/ALLEY_CREEK_CAMP_3.webp", "images/ALLEY_CREEK_CAMP_4.webp", "images/ALLEY_CREEK_CAMP_5.webp", "images/ALLEY_CREEK_CAMP_6.webp", "images/ALLEY_CREEK_CAMP_7.webp", "images/ALLEY_CREEK_CAMP_8.webp"], "verified": true, "isActive": true}
{"name": "Johnson Creek Marina", "description": "This recreation area is part of Lake O' The Pines", "locationType": "Facility", "latitude": 32.791517, "longitude": -94.541645, "address": null, "city": "Jefferson", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M205850", "images": ["images/Johnson_Creek_Marina_1.jpg", "images/Johnson_Creek_Marina_2.jpg", "images/Johnson_Creek_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Bullfrog Marina", "description": "This recreation area is part of Lake O' The Pines", "locationType": "Facility", "latitude": 32.79553961, "longitude": -94.54466028, "address": null, "city": "Jefferson", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M205850", "images": ["images/Bullfrog_Marina_1.jpg", "images/Bullfrog_Marina_2.jpg", "images/Bullfrog_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Big Cypress Marina", "description": "This recreation area is part of Lake O' The Pines", "locationType": "Facility", "latitude": 32.76214592, "longitude": -94.49700279, "address": null, "city": "Jefferson", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M205850", "images": ["images/Big_Cypress_Marina_1.jpg", "images/Big_Cypress_Marina_2.jpg", "images/Big_Cypress_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "BUCKHORN CREEK", "description": "Overview Buckhorn Creek Campground is situated along the banks of Lake O' the Pines in the Ark-La-Tex portion of the Pineywoods of east Texas near the states of Arkansas, Oklahoma, and Louisiana. Gate House Hours: 10am-6pm Monday through Saturday, 12pm-6pm Sunday. Address to get here: 2669 FM 726, Jefferson, TX 75657 Recreation Boating, fishing, water sports, and wildlife viewing are all popular pastimes at the campground. Hunting opportunities for white-tailed deer, waterfowl, and small game are available on nearby public lands. Lake O' the Pines fishing includes largemouth, spotted, and white bass along with crappie, catfish, and sunfish. In addition to boat fishing there are areas for bank fishing along the shore and below the dam along Big Cypress Bayou. Birdwatchers are also encouraged to bring their binoculars as numerous resident and migratory bird species inhabit the area. Bald eagle sightings are a common occurrence in fall and winter and they are occasionally sighted in spring and summer. Facilities Buckhorn Creek features 57 RV campsites with water and electric hookups. There are also 38 non-electric tent campsites which have a tent pad, picnic table, fire ring, and lantern pole. Restrooms with showers are located in each section of the park. Trash receptacles are located throughout the park. A boat ramp, courtesy dock, playground, and sewer dump station are also provided. Natural Features Lake O' the Pines includes about 18,700 acres of water and 9,000 acres of land, encompassing an area so large it spans five counties. The lake was created by the construction of the Ferrell's Bridge Dam on the Big Cypress Bayou. The reservoir was originally created as part of the overall plan for flood control in the Red River Basin below Denison Dam in Oklahoma, and has now become a recreational oasis for outdoor enthusiasts. Nearby Attractions The nearby towns of Jefferson and Marshall offer plenty of historic and tourist attractions, and Texas Wildflower Trail routes are located along the roads surrounding the lake.", "locationType": "Campground", "latitude": 32.7552778, "longitude": -94.4944444, "address": "2669 FM 726", "city": "JEFFERSON", "state": "TX", "country": "US", "amenities": ["BUC1", "LAKE OF THE PINES", "LAKE O THE PINES", "FERRELLS BRIDGE DAM"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "903-665-8261", "directions": "From Jefferson, TX, travel 3.8 miles northwest on Highway 49. Turn left onto FM 729 and continue for 3.5 miles, then turn left again onto FM 726. Travel 2.5 miles.  The park entrance is on the right."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/BUCKHORN_CREEK_1.webp", "images/BUCKHORN_CREEK_2.webp", "images/BUCKHORN_CREEK_3.webp", "images/BUCKHORN_CREEK_4.webp", "images/BUCKHORN_CREEK_5.webp", "images/BUCKHORN_CREEK_6.webp", "images/BUCKHORN_CREEK_7.webp", "images/BUCKHORN_CREEK_8.webp", "images/BUCKHORN_CREEK_9.webp"], "verified": true, "isActive": true}
{"name": "JOHNSON CREEK DAY USE", "description": "Overview Johnson Creek Day Use Area is situated along the banks of the Lake O' the Pines in the Ark-La-Tex portion of the Pineywoods of east Texas near the states of Arkansas, Oklahoma, and Louisiana. Address to get here: 580 Crestwood Lp. Avinger, TX 75657 Recreation Boating, fishing, water sports, and wildlife viewing are all popular pastimes at the campground. Hunting opportunities for white-tailed deer, waterfowl, and small game are available on nearby public lands. Lake O' the Pines fishing includes largemouth, spotted, and white bass along with crappie, catfish, and sunfish. In addition to boat fishing there are areas for bank fishing along the shore and below the dam along Big Cypress Bayou. Birdwatchers are also encouraged to bring their binoculars as numerous resident and migratory bird species inhabit the area. Bald eagle sightings are a common occurrence in fall and winter and they are occasionally sighted in spring and summer. best waterfowl hunting in East Texas. Facilities Johnson Creek offers a large group picnic shelter, complete with electric hookups, that can accommodate up to 100 guests. A boat ramp, courtesy dock, fishing dock, volleyball court, and swimming beach are also provided, making the area perfect for large parties or family functions. Natural Features Lake O' the Pines includes about 18,700 acres of water and 9,000 acres of land. The Johnson Creek Day Use Area is located near the confluence of Johnson Creek and Lake O' the Pines. The lake was created by the construction of the Ferrell's Bridge Dam on the Big Cypress Bayou. The reservoir was originally created as part of the overall plan for flood control in the Red River Basin below Denison Dam in Oklahoma, and has now become a recreational oasis for outdoor enthusiasts. Nearby Attractions Other historic and tourist attractions are nearby in the towns of Jefferson and Marshall, and Texas Wildflower Trail routes are located along the roads surrounding the lake.", "locationType": "Campground", "latitude": 32.7891667, "longitude": -94.5480556, "address": "2669 FM 726", "city": "Jefferson", "state": "TX", "country": "US", "amenities": ["None"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "903-665-2336", "directions": "From Jefferson, Texas, travel 3.8 miles northwest on Highway 49. Turn left onto FM 729 and continue for just over 8.5 miles.  Park entrance will be on the left."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/JOHNSON_CREEK_DAY_USE_1.webp", "images/JOHNSON_CREEK_DAY_USE_2.webp", "images/JOHNSON_CREEK_DAY_USE_3.webp", "images/JOHNSON_CREEK_DAY_USE_4.webp", "images/JOHNSON_CREEK_DAY_USE_5.webp", "images/JOHNSON_CREEK_DAY_USE_6.webp", "images/JOHNSON_CREEK_DAY_USE_7.webp", "images/JOHNSON_CREEK_DAY_USE_8.webp", "images/JOHNSON_CREEK_DAY_USE_9.webp", "images/JOHNSON_CREEK_DAY_USE_10.webp", "images/JOHNSON_CREEK_DAY_USE_11.webp", "images/JOHNSON_CREEK_DAY_USE_12.webp", "images/JOHNSON_CREEK_DAY_USE_13.webp"], "verified": true, "isActive": true}
{"name": "JOHNSON CREEK CAMP", "description": "Overview Johnson Creek Campground is situated along the banks of Lake O' the Pines in the in the Ark-La-Tex portion of the Pineywoods of east Texas near Arkansas, Oklahoma, and Louisiana. Gate House Hours: 10am-6pm Monday through Saturday, 12pm-6pm Sunday. Address to get here: 580 Crestwood Lp. Avinger, TX 75657 Recreation Boating, fishing, water sports, and wildlife viewing are all popular pastimes at the campground. Hunting opportunities for white-tailed deer, waterfowl, and small game are available on nearby public lands. Lake O' the Pines fishing includes largemouth, spotted, and white bass along with crappie, catfish, and sunfish. In addition to boat fishing there are areas for bank fishing along the shore and below the dam along Big Cypress Bayou. Birdwatchers are also encouraged to bring their binoculars as numerous resident and migratory bird species inhabit the area. Bald eagle sightings are a common occurrence in fall and winter and they are occasionally sighted in spring and summer. Facilities Johnson Creek features 63 RV campsites with water and electric hookups. There are also 22 tent campsites, 10 of these sites have electricity available. A group camping area is also available which features a covered picnic shelter with restrooms and showers and 12 RV campsites with water and electric hookups. Restrooms with showers are located in each section of the park. Trash receptacles are located throuhout the park. A boat ramp, playground, swimming beach, and sewer dump station are also provided. Natural Features Lake O' the Pines includes about 18,700 acres of water and 9,000 acres of land, encompassing an area so large it spans five counties. The lake was created by the construction of the Ferrell's Bridge Dam on the Big Cypress Bayou. The reservoir was originally created as part of the overall plan for flood control in the Red River Basin below Denison Dam in Oklahoma, and has now become a recreational oasis for outdoor enthusiasts. Nearby Attractions Other historic and tourist attractions are nearby in the towns of Jefferson and Marshall, and Texas Wildflower Trail routes are located along the roads surrounding the lake.", "locationType": "Campground", "latitude": 32.7869722, "longitude": -94.5506694, "address": "2669 FM 726", "city": "JEFFERSON", "state": "TX", "country": "US", "amenities": ["JOCC", "LAKE OF THE PINES", "LAKE O THE PINES", "FERRELLS BRIDGE DAM"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "903-755-2435", "directions": "From Jefferson, Texas, travel 3.8 miles northwest on Highway 49. Turn left onto FM 729 and continue for 8.5 miles to the park entrance on the left.."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/JOHNSON_CREEK_CAMP_1.webp", "images/JOHNSON_CREEK_CAMP_2.webp", "images/JOHNSON_CREEK_CAMP_3.webp", "images/JOHNSON_CREEK_CAMP_4.webp", "images/JOHNSON_CREEK_CAMP_5.webp", "images/JOHNSON_CREEK_CAMP_6.webp", "images/JOHNSON_CREEK_CAMP_7.webp", "images/JOHNSON_CREEK_CAMP_8.webp", "images/JOHNSON_CREEK_CAMP_9.webp", "images/JOHNSON_CREEK_CAMP_10.webp", "images/JOHNSON_CREEK_CAMP_11.webp", "images/JOHNSON_CREEK_CAMP_12.webp", "images/JOHNSON_CREEK_CAMP_13.webp", "images/JOHNSON_CREEK_CAMP_14.webp", "images/JOHNSON_CREEK_CAMP_15.webp", "images/JOHNSON_CREEK_CAMP_16.webp", "images/JOHNSON_CREEK_CAMP_17.webp", "images/JOHNSON_CREEK_CAMP_18.webp"], "verified": true, "isActive": true}
{"name": "BRUSHY CREEK", "description": "Overview Brushy Creek Campground is situated along the banks of Lake O' the Pines in the Ark-La-Tex portion of the Pineywoods of east Texas near the states of Arkansas, Oklahoma, and Louisiana. Gate House Hours: 10am-6pm Monday through Saturday, 12pm-6pm Sunday. Address to get here: . Jefferson, TX 75657 Recreation Boating, fishing, water sports, and wildlife viewing are all popular pastimes at the campground. Hunting opportunities for white-tailed deer, waterfowl, and small game are available on nearby public lands. Lake O' the Pines fishing includes largemouth, spotted, and white bass along with crappie, catfish, and sunfish. In addition to boat fishing there are areas for bank fishing along the shore and below the dam along Big Cypress Bayou. Birdwatchers are also encouraged to bring their binoculars as numerous resident and migratory bird species inhabit the area. Bald eagle sightings are a common occurrence in fall and winter and they are occasionally sighted in spring and summer. Facilities Brushy Creek features 62 RV campsites with water and electric hookups. There are also 37 tent campsites, 12 of these sites have electricity available. Restrooms with showers are located in each section of the park. Trash receptacles are located throuhout the park. A boat ramp, courtesy dock, playground, swimming beach, fishing dock, and sewer dump station are also provided. Natural Features Lake O' the Pines includes about 18,700 acres of water and 9,000 acres of land, encompassing an area so large it spans five counties. The lake was created by the construction of the Ferrell's Bridge Dam on the Big Cypress Bayou. The reservoir was originally created as part of the overall plan for flood control in the Red River Basin below Denison Dam in Oklahoma, and has now become a recreational oasis for outdoor enthusiasts. Nearby Attractions The nearby towns of Jefferson and Marshall offer plenty of historic and tourist attractions, and Texas Wildflower Trail routes are located along the roads surrounding the lake.", "locationType": "Campground", "latitude": 32.7427778, "longitude": -94.5358333, "address": "2669 FM 726", "city": "JEFFERSON", "state": "TX", "country": "US", "amenities": ["BRUC", "LAKE OF THE PINES", "LAKE O PINES", "FERRELLS BRIDGE DAM"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "903-777-3491", "directions": "From Jefferson, TX, travel 3.8 miles northwest on Highway 49. Turn left onto FM 729 and continue for approximately 3.5 miles, then turn left again onto FM 726. Travel 5.0 miles, turn right at the stop sign and follow signs to the park entrance. "}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/BRUSHY_CREEK_1.webp", "images/BRUSHY_CREEK_2.webp", "images/BRUSHY_CREEK_3.webp", "images/BRUSHY_CREEK_4.webp", "images/BRUSHY_CREEK_5.webp"], "verified": true, "isActive": true}
{"name": "Buckhorn Campground Loop B", "description": "Buckhorn Campground has four loops. Loop B is open seasonally on a first come, first served basis. There are no hookups for RVs on Loop B. Located next to Lake of the Arbuckles, Buckhorn Campground is also located near the Buckhorn Boat Launch and near the southern trailhead for the Rock Creek Multi-Use Trail.", "locationType": "Campground", "latitude": 34.427161, "longitude": -96.992067, "address": null, "city": null, "state": null, "country": "US", "amenities": ["Buckhorn Campground Loop B"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(580) 622-7234", "email": "chic_interpretation@nps.gov", "directions": "Buckhorn Campground Loop B directions and information are available at <a href=\"https://www.nps.gov/chic/planyourvisit/campgrounds.htm\" rel=\"nofollow\">https://www.nps.gov/chic/planyourvisit/campgrounds.htm</a>."}, "websiteUrl": "https://www.nps.gov/chic/planyourvisit/campgrounds.htm", "images": ["images/Buckhorn_Campground_Loop_B_1.jpg", "images/Buckhorn_Campground_Loop_B_2.jpg", "images/Buckhorn_Campground_Loop_B_3.jpg"], "verified": true, "isActive": true}
{"name": "Buckhorn Campground Loop D", "description": "Buckhorn Campground has four loops. Loop D is open year round. Campsite on Loop D are first come, first served. Located next to Lake of the Arbuckles, Buckhorn Campground is also located near the Buckhorn Boat Launch and near the southern trailhead for the Rock Creek Multi-Use Trail.", "locationType": "Campground", "latitude": 34.432767, "longitude": -96.997482, "address": null, "city": null, "state": null, "country": "US", "amenities": ["Buckhorn Campground Loop D"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(580) 622-7234", "email": "chic_interpretation@nps.gov", "directions": "Buckhorn Campground Loop D directions and information are available at <a href=\"https://www.nps.gov/chic/planyourvisit/campgrounds.htm\" rel=\"nofollow\">https://www.nps.gov/chic/planyourvisit/campgrounds.htm</a>."}, "websiteUrl": "https://www.nps.gov/chic/planyourvisit/campgrounds.htm", "images": ["images/Buckhorn_Campground_Loop_D_1.jpg", "images/Buckhorn_Campground_Loop_D_2.jpg", "images/Buckhorn_Campground_Loop_D_3.jpg"], "verified": true, "isActive": true}
{"name": "BURNS RUN EAST", "description": "Overview Burns Run East Campground is located on Lake Texoma in Oklahoma's Cross Timbers Region. The lake is said to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where Striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities Burns Run East offers to 47 campsites, 44 of which have electrical and water hookups. A large, day-use group picnic shelter with electricity is available as well. Other amenities include flush and vault toilets, showers and drinking water. A dump station, two boat ramps, a dock, playground, and beach are located on-site. Restaurants and stores are available 1/2-mile from the campground. Natural Features The campground is situated on the southeastern shores of Lake Texoma. Post and blackjack oaks forest the rolling hills of the region. Deer, turkeys, bobcats, hawks, waterfowl and songbirds are abundant around the lake. Nearby Attractions The lake features two wildlife refuges, two state parks and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.8513889, "longitude": -96.5747222, "address": "525 East Burns Road", "city": "Cartwright ", "state": "OK", "country": "US", "amenities": ["BURR", "TEXOMA LAKE", "EAST BURNS RUN", "BURNS RUN", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-965-4660", "directions": "From Highway 75 in Denison, Texas, take Exit 72 to Highway 91, travel north on 91 across Denison Dam 5 miles, take first exit left. Physical address: 525 East Burns Run Road Cartwright, OK 74731."}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/73108_BURR.pdf", "images": ["images/BURNS_RUN_EAST_1.webp", "images/BURNS_RUN_EAST_2.webp", "images/BURNS_RUN_EAST_3.webp", "images/BURNS_RUN_EAST_4.webp", "images/BURNS_RUN_EAST_5.webp", "images/BURNS_RUN_EAST_6.webp", "images/BURNS_RUN_EAST_7.webp", "images/BURNS_RUN_EAST_8.webp", "images/BURNS_RUN_EAST_9.webp", "images/BURNS_RUN_EAST_10.webp", "images/BURNS_RUN_EAST_11.webp", "images/BURNS_RUN_EAST_12.webp", "images/BURNS_RUN_EAST_13.webp", "images/BURNS_RUN_EAST_14.webp"], "verified": true, "isActive": true}
{"name": "CANEY CREEK", "description": "Overview Caney Creek Campground is located on Lake Texoma in Oklahoma's Cross Timbers Region. The lake is said to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities This campground offers 41 campsites with electrical and water hookups, and 10 basic sites without hookups. A day-use group picnic shelter with electricity is available as well. Other amenities include flush and vault toilets, showers, drinking water, and paved access. A boat ramp, dock, small playground and dump station are located on-site. Natural Features The campground is situated on the northern side of Lake Texoma. Post and blackjack oaks forest the rolling hills of the region. Deer, turkeys, bobcats, hawks, waterfowl and songbirds are abundant around the lake. Nearby Attractions The lake features two wildlife refuges, two state parks and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.930155, "longitude": -96.70581, "address": null, "city": "", "state": "OK", "country": "US", "amenities": ["CAEK", "TEXOMA LAKE", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-564-2632", "directions": "From Hwy 32 in Kingston, OK, take Donahoo Road south. Follow signs 6 miles on paved access road to the campground."}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/73111_CAEK.pdf", "images": ["images/CANEY_CREEK_1.webp", "images/CANEY_CREEK_3.webp", "images/CANEY_CREEK_4.webp", "images/CANEY_CREEK_5.webp", "images/CANEY_CREEK_6.webp", "images/CANEY_CREEK_7.webp", "images/CANEY_CREEK_8.webp", "images/CANEY_CREEK_9.webp", "images/CANEY_CREEK_10.webp", "images/CANEY_CREEK_11.webp"], "verified": true, "isActive": true}
{"name": "PRESTON BEND", "description": "Overview Preston Bend Campground is located on Lake Texoma, in the Cross Timbers region of Texas. The lake is said to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities This small but popular campground offers 22 campsites with electrical and water hookups, and 12 basic sites without hookups. Other amenities include flush and vault toilets, showers and drinking water. A dump station, boat ramp and dock are located on-site. Many resorts and marinas are nearby on the Preston Peninsula. Natural Features The campground is situated on the Texas side of Lake Texoma. Post and blackjack oaks forest the rolling hills of the region. Deer, turkeys, bobcats, hawks, waterfowl and songbirds are abundant around the lake. Contact Info For facility specific information, please call (903) 465-4990. Nearby Attractions The lake features two wildlife refuges, two state parks and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.880106, "longitude": -96.648752, "address": "129 Preston Bend Park Road", "city": "Pottsboro", "state": "TX", "country": "US", "amenities": ["PRES", "TEXOMA LAKE", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "903-786-8408", "directions": "From Pottsboro, TX, travel 9 miles north on Hwy 289. Exit right at the campground."}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/73357_PRES.pdf", "images": ["images/PRESTON_BEND_1.webp", "images/PRESTON_BEND_2.webp", "images/PRESTON_BEND_3.webp", "images/PRESTON_BEND_4.webp", "images/PRESTON_BEND_5.webp", "images/PRESTON_BEND_6.webp", "images/PRESTON_BEND_7.webp", "images/PRESTON_BEND_8.webp"], "verified": true, "isActive": true}
{"name": "BUCKHORN PAVILION", "description": "Overview Buckhorn Pavilion provides a scenic opportunity to rent a day-use space for your next outdoor event or celebration. Located at the end of Buckhorn Road, it is approximately 10 minutes from the town of Sulphur and is an ideal spot for hosting birthday parties and other gatherings with friends and family. Ample parking and a spacious lakeside view make this pavilion ideal for larger groups. Note: Buckhorn Pavilion is not a campsite. Overnight stays are not permitted. Recreation Bring a swimsuit for quality swimming. The grass-covered grounds near the pavilion are spacious and ideal for games like frisbee and cornhole. Facilities The pavilion is available year-round, with generally mild winters. Picnic tables and charcoal grills are available for use, so don't forget to pack the hot dogs or steaks. No electricity is provided at this location, but a boat launch is easily accessible. Natural Features Lake of the Arbuckles is a popular fishing and recreational destination in southeastern Oklahoma. The lake is part of the Chickasaw National Recreation Area and offers 36 miles of shoreline and 2,300 acres of open water. It's known for clear water and is a good spot for trolling and fishing, with species like catfish, crappie, bass, and perch commonly caught. The lake also provides year-round fishing opportunities. Nearby Attractions The Platt Historic District, approximately 10 minutes away, offers a variety of scenic hiking trails. Stop by the Travertine Nature Center for Junior Ranger books, National Park passport stamps, and to see native wildlife on display.", "locationType": "Campground", "latitude": 34.4375, "longitude": -97.0094444, "address": "901 West 1st Street", "city": "Sulphur", "state": "OK", "country": "US", "amenities": ["Chickasaw National Recreation Area"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": " 580-622-7234", "directions": "<p>From I-35, take Exit 55 or 51 and drive towards the city of Davis, OK. Once in Davis, go east on Highway 7 and watch for Chickasaw National Recreation Area signs to direct you to your selected area. For the Buckhorn campgrounds, boat ramp, pavilion, and picnic areas, drive approximately 9 miles east on Highway 7 in Davis to the only 4 way stop (Jct Hwy 7 and Hwy 177) in the city of Sulphur. Turn right and drive approximately 5 miles on Hwy 177. Turn right at Buckhorn Road and watch for signs to direct you to the correct area. Follow the directional signs. The pavilion is located at the end of Buckhorn Road near the boat ramp parking area.</p>"}, "websiteUrl": "http://www.okladot.state.ok.us/", "images": ["images/BUCKHORN_PAVILION_1.webp", "images/BUCKHORN_PAVILION_2.webp", "images/BUCKHORN_PAVILION_3.webp", "images/BUCKHORN_PAVILION_4.webp", "images/BUCKHORN_PAVILION_5.webp", "images/BUCKHORN_PAVILION_6.webp", "images/BUCKHORN_PAVILION_7.webp", "images/BUCKHORN_PAVILION_8.webp"], "verified": true, "isActive": true}
{"name": "LAKESIDE (OK)", "description": "Overview Lakeside Campground is located on Lake Texoma in Oklahoma's Cross Timbers Region. The lake is said to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities This popular campground offers 137 campsites, most of which have electrical and water hookups. A large, day-use group picnic shelter is available with hookups as well. Other amenities include flush and vault toilets, showers, and drinking water. Two dump stations, two boat ramps and two docks are located on-site. Natural Features The campground is situated on the eastern side of Lake Texoma. Post and blackjack oaks forest the rolling hills of the region. Deer, turkey, bobcats, hawks, waterfowl and songbirds are abundant around the lake. Nearby Attractions The lake features two wildlife refuges, two state parks, and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.940616, "longitude": -96.552752, "address": "3991 Streetman Rd", "city": "Mead", "state": "OK", "country": "US", "amenities": ["LASD", "TEXOMA LAKE", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-920-0176", "directions": "From Durant, Oklahoma, travel 10 miles west on HWY 70 to Streetman Road. Turn south on Streetman Road and follow it 4 miles to the park entrance.<br/>\n<br/>\nPhysical address: 3991 Streetman Road, Mead, OK 73449"}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/73243_LASD.pdf", "images": ["images/LAKESIDE_OK_1.webp", "images/LAKESIDE_OK_2.webp", "images/LAKESIDE_OK_3.webp", "images/LAKESIDE_OK_4.webp", "images/LAKESIDE_OK_5.webp"], "verified": true, "isActive": true}
{"name": "JOHNSON CREEK", "description": "Overview Johnson Creek Campground is located on Lake Texoma in Oklahoma's Cross Timbers Region. The lake is said to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities This popular campground offers 54 paved campsites with electrical and water hookups. Sites 15-17, 44, 49, 50, and 52-54 have covered picnic tables. A day-use group picnic shelter with electricity is available as well. Other amenities include flush and vault toilets, showers and drinking water. A boat ramp, dock and dump station are located on-site. A marina and general store are within one mile of the campground. Natural Features The campground is situated on the eastern side of Lake Texoma. Post and blackjack oaks forest the rolling hills of the region. Deer, turkeys, bobcats, hawks, waterfowl and songbirds are abundant around the lake. Nearby Attractions The lake features two wildlife refuges, two state parks and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.9998416, "longitude": -96.570108, "address": null, "city": "", "state": "OK", "country": "US", "amenities": ["JOCR", "TEXOMA LAKE", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-924-7316", "directions": "From Durant, OK, travel 11 miles west on Highway 70. Exit off Highway 70 to the north and the park entrance is 300 yards ahead. Physical address: 215 Johnson Creek Road, Mead, OK 73449."}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/73231_JOCR.pdf", "images": ["images/JOHNSON_CREEK_1.webp", "images/JOHNSON_CREEK_2.webp", "images/JOHNSON_CREEK_3.webp", "images/JOHNSON_CREEK_4.webp", "images/JOHNSON_CREEK_5.webp", "images/JOHNSON_CREEK_6.webp", "images/JOHNSON_CREEK_7.webp", "images/JOHNSON_CREEK_8.webp", "images/JOHNSON_CREEK_9.webp"], "verified": true, "isActive": true}
{"name": "The Point Campground (Chickasaw)", "description": "Overview The Point Campground is a family-friendly campground located on Lake of the Arbuckles. Popular recreational activities include boating, swimming, fishing, bicycling, and birding. Due to its relaxed atmosphere, The Point Campground is a great outdoor destination for visitors of all ages and backgrounds. Recreation Bring your boats and jet skis to enjoy the lake or pack your fishing rods to catch some of the state's finest bass, catfish, and crappie. This area is most popular for watersports but birding and bicycling are also great ways to explore this area of the park and take in scenic views of Lake of the Arbuckles. The boat ramp and day use picnic areas are conveniently located less than a mile from the campgrounds. Facilities Campgrounds in the Upper and Lower Loops have a mixture of electric and non-electric campsites. Water hookups are available at the electric sites. There are no sewer hookups, but a dump station is conveniently located less than a mile from the campgrounds. Upper Loop restrooms are pit toilets. Lower Loop restrooms have flush toilets, sinks, and showers. There are no firewood vendors in the park. Visitors can gather dead and downed wood in the campgrounds or drive to the nearby town of Sulphur to purchase firewood. Natural Features Set in the rolling Arbuckle Mountains, The Point Campground is surrounded by unique flora, fauna, and geological formations. This area of Oklahoma is part of the Crosstimbers, where the western plains meet the eastern forests, and offers abundant opportunities for wildlife viewing and recreational enjoyment. Nearby Attractions Try Little Niagara, a favorite freshwater swimming hole. The Travertine Nature Center is a wonderful resource to view nature exhibits, meet live animals on display and listen to rangers' presentations. If visitors are in need of supplies, groceries or boat rentals, head to the neighboring city of Sulphur. Charges & Cancellations Refunds will not be given due to inclement weather. Please read the official cancellation rules and policies of recreation.gov thoroughly before booking your campsite.", "locationType": "Campground", "latitude": 34.46, "longitude": -97.02, "address": "901 West 1st Street", "city": "SULPHUR", "state": "OK", "country": "US", "amenities": ["TPCG", "CHICKASAW NATIONAL REC. AREA", "PLATT NATIONAL PARK", "ARBUCKLE LAKE", "LAKE ARBUCKLE", "LAKE OF THE ARBUCKLES", "CHICKSAW"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-622-7234", "directions": "<p>From I-35, take Exit 55 and drive towards the city of Davis, OK. Once in Davis, go east on Highway 7 until you reach the stoplight at Cooper Memorial Road in Sulphur. Turn right on Cooper Memorial Road and drive approximately 8 miles to reach The Point Campground Road. Watch for signage.</p>"}, "websiteUrl": "http://www.okladot.state.ok.us/", "images": ["images/The_Point_Campground_Chickasaw_1.webp", "images/The_Point_Campground_Chickasaw_2.webp", "images/The_Point_Campground_Chickasaw_3.webp", "images/The_Point_Campground_Chickasaw_4.webp"], "verified": true, "isActive": true}
{"name": "VETERANS LAKE PAVILION", "description": "Overview Veterans Lake Pavilion provides a scenic opportunity to rent a space for your next outdoor event or celebration. Located in the Platt Historic District, it is approximately 5-7 minutes from the town of Sulphur and is an ideal spot for hosting birthday parties and other gatherings with friends and family. A fishing dock and exercise area are located nearby. These areas may be used by your party but are also open to the public. Recreation Boat, swim, or fish on Veterans Lake. Hike, walk or bike the Veteran's Trail that loops around the lake. Veteran's Trail is the only paved trail in the park, which makes it stroller and roller blade-friendly. Visit the park's Hiking and Walking page for more trails. The Bison Pasture is just up the road, so bring the kids and cameras to see the beautiful animals grazing. Facilities The 40-person picnic area has easy access to a boat launch. There's a grill but no electricity, so be sure to bring charcoal if you plan to have a cookout. Natural Features Chickasaw National Recreation Area is where two ecosystems, the eastern deciduous forest and the mixed-grass prairie of the west, converge. This creates unique geological formations and attracts a wide variety of plant and animal species. Nearby Attractions The Travertine Nature Center is worth a visit, as is the collection of springs and seeps nearby. Pavilion Springs, Black Sulphur Springs and Hillside Springs are the region's remaining natural mineral springs and have historically been used for medicinal and restorative healing.", "locationType": "Campground", "latitude": 34.4288889, "longitude": -96.9897222, "address": "901 West 1st Street", "city": "Sulphur", "state": "OK", "country": "US", "amenities": ["Chickasaw National Recreation Area"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-622-7234", "directions": "<p>From I-35, take Exit 55 or 51 and drive towards the city of Davis, OK. Once in Davis, go east towards Sulphur on Highway 7. Watch for the Chickasaw National Recreation Area signs. For Veterans Lake Pavilion, drive approximately 8 miles (13 km) east on Highway 7 from Davis and turn south (right) on 12th Street in Sulphur. The road ends at a stop sign shortly after entering the park. Turn right at the stop sign and follow the signs to Veterans Lake Pavilion.</p>\n"}, "websiteUrl": "http://www.okladot.state.ok.us/", "images": ["images/VETERANS_LAKE_PAVILION_1.webp", "images/VETERANS_LAKE_PAVILION_2.webp", "images/VETERANS_LAKE_PAVILION_3.webp", "images/VETERANS_LAKE_PAVILION_4.webp"], "verified": true, "isActive": true}
{"name": "PLATTER FLATS", "description": "Overview Platter Flats Campground is located on Lake Texoma in Oklahoma's Cross Timbers Region. The lake is said to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities This campground offers 26 family campsites with electrical/water hookups, 35 equestrian sites with hookups, and 3 equestrian tent sites without hookups. A day-use group picnic shelter with electricity is available. Other amenities include flush and vault toilets, showers and drinking water. A dump station, boat ramp and dock are located on-site. Natural Features The campground is situated on the eastern side of Lake Texoma. Post and blackjack oaks forest the rolling hills of the region. Deer, turkeys, bobcats, hawks, waterfowl and songbirds are abundant around the lake. Nearby Attractions The lake features two wildlife refuges, two state parks and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.921598, "longitude": -96.547693, "address": "351 CORPS RD", "city": "DENISON", "state": "TX", "country": "US", "amenities": ["PLAT", "TEXOMA LAKE", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-434-5864", "directions": "From Colbert, Oklahoma, travel 5 miles north on US 75, turn west 5 miles to Platter Flats, OK, then follow signs to the campground. Physical address: 867 Trail Ride Road, Platter, OK 74753."}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/73345_PLAT.pdf", "images": ["images/PLATTER_FLATS_1.webp", "images/PLATTER_FLATS_2.webp", "images/PLATTER_FLATS_3.webp", "images/PLATTER_FLATS_4.webp", "images/PLATTER_FLATS_5.webp", "images/PLATTER_FLATS_6.webp", "images/PLATTER_FLATS_7.webp", "images/PLATTER_FLATS_8.webp", "images/PLATTER_FLATS_9.webp", "images/PLATTER_FLATS_10.webp", "images/PLATTER_FLATS_11.webp"], "verified": true, "isActive": true}
{"name": "BUNCOMBE CREEK", "description": "Overview Buncombe Creek Campground is located on Lake Texoma in Oklahoma's Cross Timbers Region. The lake is said to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities This campground offers 54 campsites with electrical and water hookups. Other amenities include flush and vault toilets, showers, drinking water and paved access. Two boat ramps, a dock and dump station are located on-site. Natural Features The campground is situated on the northern side of Lake Texoma. Post and blackjack oaks forest the rolling hills of the region. Deer, turkeys, bobcats, hawks, waterfowl and songbirds are abundant around the lake. Nearby Attractions The lake features two wildlife refuges, two state parks and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.896715, "longitude": -96.81025, "address": "15824 West Buncombe Creek Road", "city": "Kingston", "state": "OK", "country": "US", "amenities": ["BUNC", "TEXOMA LAKE", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-564-2901", "directions": "From Madill, OK, travel south on Highway 99 for 17 miles to Willis, OK, then east for one mile on paved access road. Physical address: 1010 West Buncombe Creek Road, Willis, OK 75020."}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/73107_BUNC.pdf", "images": ["images/BUNCOMBE_CREEK_1.webp", "images/BUNCOMBE_CREEK_2.webp", "images/BUNCOMBE_CREEK_3.webp", "images/BUNCOMBE_CREEK_4.webp", "images/BUNCOMBE_CREEK_5.webp", "images/BUNCOMBE_CREEK_6.webp", "images/BUNCOMBE_CREEK_7.webp", "images/BUNCOMBE_CREEK_8.webp"], "verified": true, "isActive": true}
{"name": "BURNS RUN WEST", "description": "Overview Burns Run West Campground is located on Lake Texoma in Oklahoma's Cross Timbers Region. The lake is thought to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking, and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish, and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities Burns Run West offers 117 family campsites, 105 of which have electrical and water hookups. Five group campsites and two large, day-use group picnic shelters with electricity are available as well. Other amenities include flush and vault toilets, showers and drinking water. Three dump stations, a boat ramp, playground and beach are located on-site. Natural Features The campground is situated on the southeastern shores of Lake Texoma, with beautiful views overlooking the main portion of lake. Post and blackjack oaks forest the rolling hills of the region. Deer, turkeys, bobcats, hawks, waterfowl, and songbirds are abundant around the lake. Nearby Attractions The lake features two wildlife refuges, two state parks, and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.863266, "longitude": -96.580229, "address": "825 West Burns Road", "city": "Cartwright", "state": "OK", "country": "US", "amenities": ["BURW", "TEXOMA LAKE", "WEST BURNS RUN", "BURNS RUN", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-965-4922", "directions": "From Highway 75 in Denison, Texas, take Exit 72 to Highway 91, travel north on 91 across Denison Dam, 5 miles. Take the second left, follow signs for about 1.5 miles. <br/>\n<br/>Physical address: 825 West Burns Run Road, Cartwright, OK 74731"}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/73533_BURW.pdf", "images": ["images/BURNS_RUN_WEST_1.webp", "images/BURNS_RUN_WEST_2.webp", "images/BURNS_RUN_WEST_3.webp", "images/BURNS_RUN_WEST_4.webp", "images/BURNS_RUN_WEST_5.webp", "images/BURNS_RUN_WEST_6.webp", "images/BURNS_RUN_WEST_7.webp", "images/BURNS_RUN_WEST_8.webp", "images/BURNS_RUN_WEST_9.webp", "images/BURNS_RUN_WEST_10.webp", "images/BURNS_RUN_WEST_11.webp"], "verified": true, "isActive": true}
{"name": "Texoma Marina & Resort", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.930507, "longitude": -96.642017, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Texoma_Marina_Resort_1.jpg", "images/Texoma_Marina_Resort_2.jpg", "images/Texoma_Marina_Resort_3.jpg"], "verified": true, "isActive": true}
{"name": "Rock Creek Resort", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.860928, "longitude": -96.886828, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Rock_Creek_Resort_1.jpg", "images/Rock_Creek_Resort_2.jpg", "images/Rock_Creek_Resort_3.jpg"], "verified": true, "isActive": true}
{"name": "JUNIPER POINT", "description": "Overview The Juniper Point Campground is located on Lake Texoma, in the Cross Timbers region of Texas. The lake is said to be the \"Playground of the Southwest,\" where outdoor activities like fishing, boating, hiking and hunting abound. Recreation Lake Texoma is a large reservoir with an excellent fishery and many access points. Boating, swimming, water skiing, hunting, birding and relaxing on the sandy beaches are the typical pursuits of most visitors. The lake is known as the \"Striper Capital of the World,\" one of the few reservoirs in the nation where striped bass reproduce naturally. Other popular species include largemouth and smallmouth bass, white bass, hybrid striped bass, white crappie, black crappie, channel catfish and blue catfish. Also available is the scenic Cross Timbers hiking trail, a very popular trail that winds for 14 miles above the lake on rocky ledges and through blackjack woodland. Forty miles of equestrian trails surround the lake as well. Facilities This campground offers 44 campsites with electrical and water hookups, and 25 basic sites without hookups. A day-use group picnic shelter with electricity is available as well. Other amenities include flush and vault toilets, showers and drinking water. Two dump stations, two boat ramps and two docks are located on-site. The site is close to beautiful sandy beaches. General stores and a marina are within one mile. Natural Features The campground is situated on the Texas side of Lake Texoma. Post and blackjack oaks forest the rolling hills of the region. Deer, turkeys, bobcats, hawks, waterfowl and songbirds are abundant around the lake. Nearby Attractions The lake features two wildlife refuges, two state parks and 23 commercial concession areas dedicated to the enjoyment of over six million visitors annually.", "locationType": "Campground", "latitude": 33.859803, "longitude": -96.832147, "address": "351 CORPS RD", "city": "DENISON", "state": "TX", "country": "US", "amenities": ["JUNP", "TEXOMA LAKE", "TEXOMA LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"directions": "West Juniper 32843 Hwy 377, Gordonville, TX 76245\nEast Juniper 32744 Hwy 377, Gordonville, TX 76245<br/>\n<br/>\nFrom Whitesboro, TX, travel 13 miles north on Highway 377. The campground is on both sides of the highway as the highway enters the Willis Bridge crossing into Oklahoma. The east side access is a contolled entrance park. The west side access is where the trailhead for the Cross Timbers hiking trail is located."}, "websiteUrl": "http://www.dot.state.tx.us/", "images": ["images/JUNIPER_POINT_1.webp", "images/JUNIPER_POINT_2.webp", "images/JUNIPER_POINT_3.webp", "images/JUNIPER_POINT_4.webp", "images/JUNIPER_POINT_5.webp", "images/JUNIPER_POINT_6.webp", "images/JUNIPER_POINT_7.webp", "images/JUNIPER_POINT_8.webp", "images/JUNIPER_POINT_9.webp", "images/JUNIPER_POINT_10.webp", "images/JUNIPER_POINT_11.webp"], "verified": true, "isActive": true}
{"name": "Tishomingo National Fish Hatchery", "description": "Construction of Tishomingo National Fish Hatchery (NFH) began in 1928, and was in full production by 1931. This 235-acre hatchery lies adjacent to Pennington Creek in south central Oklahoma. Its basic mission is to produce imperiled fish and other aquatic species in addition to recreational fish species. The species reared at the hatchery are distributed to waters of the south-central United States.", "locationType": "Facility", "latitude": 34.35166667, "longitude": -96.71388889, "address": "5501 Ok Hwy 7 West", "city": "Tishomingo", "state": "OK", "country": "US", "amenities": ["National Fish Hatchery", "Hatchery", "US Fish and Wildlife Service", "fisheries", "Fish and Aquatic Conservation"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(580) 384-5463", "email": "Kerry_Graves@fws.gov", "directions": "12 miles NW of Tishomingo, OK or 1 mile east of Reagan, OK on Hwy 7"}, "websiteUrl": "https://www.fws.gov/southwest/fisheries/tishomingo/", "images": ["images/Tishomingo_National_Fish_Hatchery_1.jpg", "images/Tishomingo_National_Fish_Hatchery_2.jpg", "images/Tishomingo_National_Fish_Hatchery_3.jpg"], "verified": true, "isActive": true}
{"name": "Buckhorn Campground (Chickasaw)", "description": "Overview Buckhorn Campground is a relaxed, family-friendly campground conveniently located 177. Popular recreational activities include boating, swimming, fishing, bicycling, and birding. Recreation Bring your boats and jet skis to enjoy the lake or pack your fishing rods to catch some of the state's finest bass, catfish, and crappie. This area is most popular for water sports but hiking trails and bicycling are also great ways to explore the park and take in scenic views of Lake of the Arbuckles. Facilities Buckhorn C and D Loops have a mixture of electric and non-electric campsites. Water hookups are available at the electric sites. There are no sewer hookups, but a dump station is conveniently located less than a mile from the campgrounds. Restrooms have flush toilets, sinks, and showers. There are no firewood vendors in the park. Visitors can gather dead and downed wood in the campgrounds or drive to the nearby town of Sulphur to purchase firewood. Natural Features Set in the rolling Arbuckle Mountains, Buckhorn Campground is surrounded by unique flora, fauna, and geological formations. This area of Oklahoma is part of the Crosstimbers, where the western plains meet the eastern forests, and offers abundant opportunities for wildlife viewing and recreational enjoyment. Nearby Attractions Hike or bike on the unpaved Rock Creek Multi-Use Trail or head up Rock Creek for a visit to the Chickasaw Cultural Center. There, you can learn all about the Native Americans of the region through exhibits, videos and interactive displays. Charges & Cancellations Refunds will not be given due to inclement weather. Please read the official cancellation rules and policies above before booking your campsite.", "locationType": "Campground", "latitude": 34.4288889, "longitude": -96.9897222, "address": "901 West 1st Street", "city": "SULPHUR", "state": "OK", "country": "US", "amenities": ["BKCG", "CHICKASAW NATIONAL REC. AREA", "PLATT NATIONAL PARK", "ARBUCKLE LAKE", "LAKE ARBUCKLE", "LAKE OF THE ARBUCKLES", "CHICKASAW"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "580-622-7234", "directions": "<p>From Interstate 35, take Exit 55 and drive towards the city of Davis, OK. Once in Davis, go east on Highway 7. Watch for the Chickasaw National Recreation Area signs. For Buckhorn Campgrounds, Pavilion, and Picnic Area<strong>,</strong> drive approximately 8 miles (13 km) east of Davis to the only 4 way STOP (Jct Hwy 7 and Hwy 177) in the city of Sulphur. Turn right on Hwy 177 and go approximately 7 miles to Buckhorn Road. Turn right at Buckhorn Road and drive all the way down until you reach your desired location. Follow the directional signs</p>"}, "websiteUrl": "http://www.okladot.state.ok.us/", "images": ["images/Buckhorn_Campground_Chickasaw_1.webp", "images/Buckhorn_Campground_Chickasaw_2.webp", "images/Buckhorn_Campground_Chickasaw_3.webp", "images/Buckhorn_Campground_Chickasaw_4.webp"], "verified": true, "isActive": true}
{"name": "Little Mineral Resort", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.8723902, "longitude": -96.6486667, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Little_Mineral_Resort_1.jpg", "images/Little_Mineral_Resort_2.jpg", "images/Little_Mineral_Resort_3.jpg"], "verified": true, "isActive": true}
{"name": "Cedar Mills Marina", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.83317214, "longitude": -96.81272382, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Cedar_Mills_Marina_1.jpg", "images/Cedar_Mills_Marina_2.jpg", "images/Cedar_Mills_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Bridgeview Camp Marina", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 34.02343184, "longitude": -96.6275763, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Bridgeview_Camp_Marina_1.jpg", "images/Bridgeview_Camp_Marina_2.jpg", "images/Bridgeview_Camp_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Buncombe Creek Resort Marina", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.88449006, "longitude": -96.78838009, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Buncombe_Creek_Resort_Marina_1.jpg", "images/Buncombe_Creek_Resort_Marina_2.jpg", "images/Buncombe_Creek_Resort_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Texoma Shores", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 34.054522, "longitude": -96.584285, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Texoma_Shores_1.jpg", "images/Texoma_Shores_2.jpg", "images/Texoma_Shores_3.jpg"], "verified": true, "isActive": true}
{"name": "Grandpappy Point Marina", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.85303476, "longitude": -96.64290244, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Grandpappy_Point_Marina_1.jpg", "images/Grandpappy_Point_Marina_2.jpg", "images/Grandpappy_Point_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Mill Creek Resort", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.81922366, "longitude": -96.77375669, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Mill_Creek_Resort_1.jpg", "images/Mill_Creek_Resort_2.jpg", "images/Mill_Creek_Resort_3.jpg"], "verified": true, "isActive": true}
{"name": "Lighthouse Marina & Resort", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.859847, "longitude": -96.662251, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Lighthouse_Marina_Resort_1.jpg", "images/Lighthouse_Marina_Resort_2.jpg", "images/Lighthouse_Marina_Resort_3.jpg"], "verified": true, "isActive": true}
{"name": "Little Glasses Marina", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 34.02162672, "longitude": -96.6566729, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Little_Glasses_Marina_1.jpg", "images/Little_Glasses_Marina_2.jpg", "images/Little_Glasses_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Cedar Bayou", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.84411542, "longitude": -96.85164804, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Cedar_Bayou_1.jpg", "images/Cedar_Bayou_2.jpg", "images/Cedar_Bayou_3.jpg"], "verified": true, "isActive": true}
{"name": "Soldier Creek Marina", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.86746769, "longitude": -96.89393038, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Soldier_Creek_Marina_1.jpg", "images/Soldier_Creek_Marina_2.jpg", "images/Soldier_Creek_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Newberry Creek Resort & Marina", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 34.01510438, "longitude": -96.56448001, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Newberry_Creek_Resort_Marina_1.jpg", "images/Newberry_Creek_Resort_Marina_2.jpg", "images/Newberry_Creek_Resort_Marina_3.jpg"], "verified": true, "isActive": true}
{"name": "Highport Resort", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.82855558, "longitude": -96.70290346, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Highport_Resort_1.jpg", "images/Highport_Resort_2.jpg", "images/Highport_Resort_3.jpg"], "verified": true, "isActive": true}
{"name": "Alberta Creek Resort, Inc.", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.95483275, "longitude": -96.60233135, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Alberta_Creek_Resort_Inc_1.jpg", "images/Alberta_Creek_Resort_Inc_2.jpg", "images/Alberta_Creek_Resort_Inc_3.jpg"], "verified": true, "isActive": true}
{"name": "Sheppark Air Force Annex", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 33.8803435, "longitude": -96.8988778, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Sheppark_Air_Force_Annex_1.jpg", "images/Sheppark_Air_Force_Annex_2.jpg", "images/Sheppark_Air_Force_Annex_3.jpg"], "verified": true, "isActive": true}
{"name": "Pennington Creek", "description": "This recreation area is part of Lake Texoma", "locationType": "Facility", "latitude": 34.23325759, "longitude": -96.68250794, "address": null, "city": "Denison", "state": "TX", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M574945", "images": ["images/Pennington_Creek_1.jpg", "images/Pennington_Creek_2.jpg", "images/Pennington_Creek_3.jpg"], "verified": true, "isActive": true}
{"name": "Buckhorn Campground Loop A", "description": "Buckhorn Campground has four loops. Loop A is open seasonally on a first come, first served basis. There are no hookups for RVs on Loop A. Located next to Lake of the Arbuckles, Buckhorn Campground is also located near the Buckhorn Boat Launch and near the southern trailhead for the Rock Creek Multi-Use Trail.", "locationType": "Campground", "latitude": 34.42967, "longitude": -96.988111, "address": null, "city": null, "state": null, "country": "US", "amenities": ["Buckhorn Campground Loop A"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "(580) 622-7234", "email": "chic_interpretation@nps.gov", "directions": "Buckhorn Campground Loop A directions and information are available at <a href=\"https://www.nps.gov/chic/planyourvisit/campgrounds.htm\" rel=\"nofollow\">https://www.nps.gov/chic/planyourvisit/campgrounds.htm</a>."}, "websiteUrl": "https://www.nps.gov/chic/planyourvisit/campgrounds.htm", "images": ["images/Buckhorn_Campground_Loop_A_1.jpg", "images/Buckhorn_Campground_Loop_A_2.jpg", "images/Buckhorn_Campground_Loop_A_3.jpg"], "verified": true, "isActive": true}
{"name": "Oak Grove (AR)", "description": "Overview Oak Grove Campground sits along the shores of DeQueen Lake in southwest Arkansas. Recreation Boating and water sports top the list of recreational actives at the lake, and several boat ramps are provided for campers. Fishing is also a popular pastime, with large mouth bass, small mouth bass, spotted pass, black and white crappie, channel and flathead catfish and various species of sunfish available in abundance. The Arkansas Game and Fish Commission have also stocked hybrid striped bass in the lake. There are plenty of opportunities for hunting on the lands around the lake. Except for developed recreation areas and lands in the vicinity of the dam, all project lands are open to the public for hunting. Game species include bobwhite quail, mourning dove, turkey, fox squirrel, gray squirrel, cottontail rabbit and deer. Although DeQueen Lake does not have a designated hiking trail, the vast expanse of land is open to the public and hiking activities are welcomed anywhere on project lands. Facilities Oak Grove Campground offers 36 spacious campsites, along with one large reservable group picnic shelter. Campsites include modern amenities like flush toilets, showers and drinking water. Natural Features DeQueen Lake is part of a dam project located on the Rolling Fork River. The dam, completed in 1977, was built for flood control and water supply, and now provides a recreational oasis for thousands of campers each year. The lake boasts 32 miles of shoreline to its visitors, along with 8,700 acres of rolling green landscape. Nearby Attractions The nearby town of DeQueen, Arkansas, offers gas, grocery and medical services.", "locationType": "Campground", "latitude": 34.0966667, "longitude": -94.3944444, "address": "706 DEQUEEN LAKE RD", "city": "DEQUEEN", "state": "AR", "country": "US", "amenities": ["OAG2", "DEQUEEN LAKE", "DEQUEEN LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "870-584-4161", "directions": "From DeQueen, AR, take Highway 71 north for 3 miles. Turn west onto DeQueen Lake Road and continue for 5.3 miles, following signs into the campground."}, "websiteUrl": "http://www.arkansashighways.com", "images": ["images/Oak_Grove_AR_1.webp", "images/Oak_Grove_AR_2.webp", "images/Oak_Grove_AR_3.webp", "images/Oak_Grove_AR_4.webp"], "verified": true, "isActive": true}
{"name": "COSSATOT REEFS", "description": "Overview Cossatot Reefs Campground sits along the lush banks of Gillham Lake in southwest Arkansas. Nicknamed the \"Bright Spot on the Cossatot,\" Gillham Lake is a recreational oasis for outdoor enthusiasts. Recreation Visitors enjoy the lake for its vast boating opportunities, and a boat ramp is provided for easy water access. The river can be canoed from a point below the dam to U.S. Highway 71 South, a distance of about 16 miles. For shorter canoe trips, there are access roads to the river at Mize Crossing and Ladd Bridge. Anglers will find smallmouth, largemouth, and spotted bass, crappie, channel and flathead catfish and various species of sunfish in the river. A short nature trail within the campground weaves through a quaint wooded section. In spring, the trail is painted with colorful redbud and dogwood blossoms. Facilities Cossatot Reefs offers 31 shady campsites, including a large group shelter. Hot showers, drinking water and flush toilets help create a comfortable camping experience. Natural Features Gillham Lake spans 1,370 surface acres and boasts 36 miles of shoreline. The lake stems from the Cossatot River, designated as a National Wild and Scenic River.", "locationType": "Campground", "latitude": 34.2067417, "longitude": -94.2313167, "address": "244 Reefs Park Road", "city": "GILLHAM", "state": "AR", "country": "US", "amenities": ["COSS", "GILLHAM LAKE", "GILLHAM LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "870-386-7261", "directions": "\n\nFrom De Queen, Arkansas, head north on US-59/US-71. Continue for nearly 10 miles and turn Right at Gillham EZ-Mart. Turn right on Tower Road; go 1.3 miles turn left onto Gillham Lake road; go 4.3 miles turn right and follow signs into the campground."}, "websiteUrl": "http://www.arkansashighways.com", "images": ["images/COSSATOT_REEFS_1.webp", "images/COSSATOT_REEFS_2.webp", "images/COSSATOT_REEFS_3.webp", "images/COSSATOT_REEFS_4.webp"], "verified": true, "isActive": true}
{"name": "BIG COON CREEK", "description": "Overview Big Coon Creek Campground sits along the lush banks of Gillham Lake in southwest Arkansas. Nicknamed the \"Bright Spot on the Cossatot,\" Gillham Lake is a recreational oasis for outdoor enthusiasts. Recreation Visitors enjoy the lake for its vast boating opportunities, and a boat ramp is provided for easy water access. The river can be canoed from a point below the dam to U.S. Highway 71 South, a distance of about 16 miles. For shorter canoe trips, there are access roads to the river at Mize Crossing and Ladd Bridge. Anglers will find smallmouth, largemouth, and spotted bass, saugeye, crappie, channel and flathead catfish and various species of sunfish in the river. Fly fishing is also a popular pastime. Hunting is allowed north of Little Coon Creek Park and on the eastern shore of the lake. Check with the Arkansas Game and Fish for Season Dates and Regulations. Facilities Coon Creek provides 32 sites, each with water and 50-amp electric hookups. Additional amenities include hot showers, a boat ramp, swimming beach, dump station and a playground. Natural Features Gillham Lake spans 1,370 surface acres and boasts 36 miles of shoreline. The lake stems from the Cossatot River, designated as a National Wild and Scenic River.", "locationType": "Campground", "latitude": 34.2221972, "longitude": -94.2439, "address": "493 POLK 246", "city": "GILLHAM", "state": "AR", "country": "US", "amenities": ["BIGC", "GILLHAM LAKE", "GILLHAM LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "870-385-7126", "directions": "From Gillham on Hwy 71, go east on Tower Rd. for 1.3 miles; Turn left onto Gillham Lake Rd. for 4.3 miles; Turn left onto Polk Road 474 for 1.7 miles."}, "websiteUrl": "http://www.arkansashighways.com", "images": ["images/BIG_COON_CREEK_1.webp", "images/BIG_COON_CREEK_2.webp", "images/BIG_COON_CREEK_3.webp"], "verified": true, "isActive": true}
{"name": "PINE RIDGE", "description": "Overview Pine Ridge Campground sits along the shores of DeQueen Lake in southwest Arkansas. Recreation Boating and water sports top the list of recreational actives at the lake, and several boat ramps are provided for campers. Fishing is also a popular pastime, with large mouth bass, small mouth bass, spotted pass, black and white crappie, channel and flathead catfish and various species of sunfish available in abundance. The Arkansas Game and Fish Commission have also stocked hybrid striped bass in the lake. There are plenty of opportunities for hunting on the lands around the lake. Except for developed recreation areas and lands in the vicinity of the dam, all project lands are open to the public for hunting. Game species include bobwhite quail, mourning dove, turkey, fox squirrel, gray squirrel, cottontail rabbit and deer. Although DeQueen Lake does not have a designated hiking trail, the vast expanse of land is open to the public and hiking activities are welcomed anywhere on project lands. Facilities Pine Ridge Campground offers 45 spacious campsites, along with one large reservable group picnic shelter. Campsites include modern amenities like flush toilets, showers and drinking water. Natural Features DeQueen Lake is part of a dam project located on the Rolling Fork River. The dam, completed in 1977, was built for flood control and water supply, and now provides a recreational oasis for thousands of campers each year. The lake boasts 32 miles of shoreline to its visitors, along with 8,700 acres of rolling green landscape. Nearby Attractions The nearby town of DeQueen, Arkansas, offers gas, grocery and medical services.", "locationType": "Campground", "latitude": 34.097722, "longitude": -94.415151, "address": "348 PINE RIDGE ROAD", "city": "DE QUEEN", "state": "AR", "country": "US", "amenities": ["PINR", "DEQUEEN LAKE", "DEQUEEN LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "870-642-6111", "directions": "From DeQueen, AR, take Highway 71 north for 3 miles. Turn west onto DeQueen Lake Road and continue for 5.5 miles, then turn west again onto County Road and follow signs into the campground."}, "websiteUrl": "http://www.arkansashighways.com", "images": ["images/PINE_RIDGE_1.webp", "images/PINE_RIDGE_2.webp", "images/PINE_RIDGE_3.webp"], "verified": true, "isActive": true}
{"name": "Carson Creek", "description": "This recreation area is part of Broken Bow Lake", "locationType": "Facility", "latitude": 34.18113, "longitude": -94.728056, "address": null, "city": "Valliant", "state": "OK", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M502040", "images": ["images/Carson_Creek_1.jpg", "images/Carson_Creek_2.jpg", "images/Carson_Creek_3.jpg"], "verified": true, "isActive": true}
{"name": "Stevens Gap", "description": "This recreation area is part of Broken Bow Lake", "locationType": "Facility", "latitude": 34.165472, "longitude": -94.724537, "address": null, "city": "Valliant", "state": "OK", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M502040", "images": ["images/Stevens_Gap_1.jpg", "images/Stevens_Gap_2.jpg", "images/Stevens_Gap_3.jpg"], "verified": true, "isActive": true}
{"name": "River Bend Area", "description": "This recreation area is part of Broken Bow Lake", "locationType": "Facility", "latitude": 34.138819, "longitude": -94.698616, "address": null, "city": "Valliant", "state": "OK", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": null, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M502040", "images": ["images/River_Bend_Area_1.jpg", "images/River_Bend_Area_2.jpg", "images/River_Bend_Area_3.jpg"], "verified": true, "isActive": true}
{"name": "BELLAH MINE", "description": "Overview Bellah Mine Campground sits along the shores of DeQueen Lake in southwest Arkansas. Recreation Boating and water sports top the list of recreational activities at the lake, and several boat ramps are provided for campers. Fishing is also a popular pastime, with large mouth bass, small mouth bass, spotted pass, black and white crappie, channel and flathead catfish and various species of sunfish available in abundance. The Arkansas Game and Fish Commission have also stocked hybrid striped bass in the lake. There are plenty of opportunities for hunting on the lands around the lake. Except for developed recreation areas and lands in the vicinity of the dam, all project lands are open to the public for hunting. Game species include bobwhite quail, mourning dove, turkey, fox squirrel, gray squirrel, cottontail rabbit and deer. Although DeQueen Lake does not have a designated hiking trail, the vast expanse of land is open to the public and hiking activities are welcomed anywhere on project lands. Facilities Bellah Mine Campground offers 24 spacious campsites, along with one large reservable group picnic shelter. Campsites include modern amenities like flush toilets, showers and drinking water. Natural Features DeQueen Lake is part of a dam project located on the Rolling Fork River. The dam, completed in 1977, was built for flood control and water supply, and now provides a recreational oasis for thousands of campers each year. The lake boasts 32 miles of shoreline to its visitors, along with 8,700 acres of rolling green landscape. Nearby Attractions The nearby town of DeQueen, Arkansas, offers gas, grocery and medical services.", "locationType": "Campground", "latitude": 34.127204, "longitude": -94.400491, "address": "706 DEQUEEN LAKE RD", "city": "DEQUEEN", "state": "AR", "country": "US", "amenities": ["BELL", "DEQUEEN LAKE", "DEQUEEN LAKE"], "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "870 386 7511", "directions": "From DeQueen, AR, take Highway 71 north for 7 miles. Turn west onto Bellah Mine Road and continue for 5 miles, following signs into the campground."}, "websiteUrl": "http://www.arkansashighways.com", "images": ["images/BELLAH_MINE_1.webp", "images/BELLAH_MINE_2.webp", "images/BELLAH_MINE_3.webp"], "verified": true, "isActive": true}
{"name": "LITTLE COON CREEK PARK", "description": "Overview Little Coon Creek Campground is located on Gillham Lake in southwestern Arkansas on the Cossatot River. The rugged terrain around the lake creates stunning views and provides for many opportunities for boating, fishing, hunting, and swimming. Recreation Visitors enjoy the lake for its vast boating opportunities, and a boat ramp is provided for easy water access. Anglers will find smallmouth, largemouth, and spotted bass, saugeye, crappie, channel and flathead catfish and various species of sunfish in the river. Fly fishing is also a popular pastime. Hunting is allowed north of Little Coon Creek Park and on the eastern shore of the lake. Check with the Arkansas Game and Fish for Season Dates and Regulations. Lake maps are also available from any Park Attendant at the lake. Facilities Little Coon Creek provides 10 campsites and a group picnic shelter; each site has water and 50-amp electric hookups available. Additional amenities include hot showers with restrooms, a boat ramp with a handicap accessible fishing pier, a playground and a dump station nearby. Natural Features Gillham Lake spans 1,370 surface acres and boasts 36 miles of shoreline. The Dam was completed in 1975 and stems from the Cossatot River, which has been designated as a National Wild and Scenic River. Nearby Attractions The Cossatot River State Park-Natural Area and the Queen Wilhelmina State Park are both within driving distance just north of Gillham Lake. Both of these attractions offer great scenery, hiking, and interpretive programs that are fun for all ages.", "locationType": "Campground", "latitude": 34.2304472, "longitude": -94.2513833, "address": "384 POLK 3", "city": "GRANNIS", "state": "AR", "country": "US", "amenities": ["COON CREEK"], "petFriendly": false, "reservationRequired": true, "seasonStart": null, "seasonEnd": null, "contactInfo": {"phone": "870-385-7126", "directions": "From US-59/71 at Grannis, Arkansas, turn east onto County Rd 3/Frachiseur Rd and stay on this road for 5 miles and then follow the signs on into the park."}, "websiteUrl": "http://www.recreation.gov/webphotos/facilitymaps/111239_LCCP.pdf", "images": ["images/LITTLE_COON_CREEK_PARK_1.webp", "images/LITTLE_COON_CREEK_PARK_2.webp", "images/LITTLE_COON_CREEK_PARK_3.webp", "images/LITTLE_COON_CREEK_PARK_4.webp"], "verified": true, "isActive": true}
{"name": "Holly Creek", "description": "This recreation area is part of Broken Bow Lake", "locationType": "Facility", "latitude": 34.283519, "longitude": -94.68822, "address": null, "city": "Valliant", "state": "OK", "country": "US", "amenities": null, "petFriendly": false, "reservationRequired": false, "seasonStart": null, "seasonEnd": null, "contactInfo": {"directions": "g N/A"}, "websiteUrl": "https://corpsLakes.erdc.dren.mil/visitors/projects.cfm?ID=M502040", "images": ["images/Holly_Creek_1.jpg", "images/Holly_Creek_2.jpg", "images/Holly_Creek_3.jpg"], "verified": true, "isActive": true}
